<?php 

/*****************************************************************************
 *                                                                           *
 *      Примерен конфигурационен файл за системата                           *
 *                                                                           *
 *      След като се попълнят стойностите на константите, този файл          *
 *      трябва да бъде записан в [conf] директорията под име:                *
 *      [име на приложението].cfg.php                                        *
 *                                                                           *
 *****************************************************************************/ 



/*****************************************************************************
 *                                                                           *
 * Задължително въведете стойности на следните константи                     *
 *                                                                           *
 *****************************************************************************/ 

// Името на приложението. Използва се за определяне на други константи
   defIfNot('EF_APP_NAME', '[#EF_APP_NAME#]');

// Име на базата данни. По подразбиране е същото, като името на приложението
   defIfNot('EF_DB_NAME', '[#EF_DB_NAME#]');

// Потребителско име. По подразбиране е същото, като името на приложението
   defIfNot('EF_DB_USER', '[#EF_DB_USER#]');

// По-долу трябва да се постави реалната парола за връзка
// с базата данни на потребителят дефиниран в предходния ред
   defIfNot('EF_DB_PASS', '[#EF_DB_PASS#]'); 
   
// Секретен ключ използван за кодиране в рамките на системата
// Той трябва да е различен, за различните инсталации на системата
// Моля сменето стойността, ако правите нова инсталация.
// След като веднъж е установен, този параметър не трябва да се променя
   defIfNot('EF_SALT', '[#EF_SALT#]');
   
// "Подправка" за кодиране на паролите
   defIfNot('EF_USERS_PASS_SALT', '[#EF_USERS_PASS_SALT#]');
   
// Имейла по подразбиране
   defIfNot('BGERP_DEFAULT_EMAIL_FROM', '[#BGERP_DEFAULT_EMAIL_FROM#]');

// Домейн  по подразбиране
   defIfNot('BGERP_DEFAULT_EMAIL_DOMAIN', '[#BGERP_DEFAULT_EMAIL_DOMAIN#]');

// Пощенска кутия по подразбиране
   defIfNot('BGERP_DEFAULT_EMAIL_USER', '[#BGERP_DEFAULT_EMAIL_USER#]');

// Хост по подразбиране
   defIfNot('BGERP_DEFAULT_EMAIL_HOST', '[#BGERP_DEFAULT_EMAIL_HOST#]');

// Парола по подразбиране
   defIfNot('BGERP_DEFAULT_EMAIL_PASSWORD', '[#BGERP_DEFAULT_EMAIL_PASSWORD#]');
   


/*****************************************************************************
 *                                                                           *
 * Параметри за връзка с базата данни                                        *
 *                                                                           *
 *****************************************************************************/ 

// Сървъра за на базата данни
   defIfNot('EF_DB_HOST', 'localhost');
 
// Кодировка на базата данни
   defIfNot('EF_DB_CHARSET', 'utf8');

/*****************************************************************************
 *                                                                           *
 * Пътища до някои важни части от системата                                  *
 *                                                                           *
 *****************************************************************************/ 

// Път по подразбиране за пакетите от 'vendors'
 # defIfNot('EF_VENDORS_PATH', EF_ROOT_PATH . '/vendors');

// Път по подразбиране за пакетите от 'private'
 # defIfNot('EF_PRIVATE_PATH', EF_ROOT_PATH . '/private');

// Базова директория, където се намират по-директориите за
// временните файлове. По подразбиране е в
// EF_ROOT_PATH/temp
 # defIfNot( 'EF_TEMP_BASE_PATH', 'PATH_TO_FOLDER');

// Базова директория, където се намират по-директориите за
// потребителски файлове. По подразбиране е в
// EF_ROOT_PATH/uploads
 # defIfNot( 'EF_UPLOADS_BASE_PATH', 'PATH_TO_FOLDER');

// Твърдо, фиксирано име на мениджъра с контролерните функции. 
// Ако се укаже, цялотоможе да има само един такъв 
// мениджър функции. Това е удобство за специфични приложения, 
// при които не е добре името на мениджъра да се вижда в URL-то
 # defIfNot('EF_CTR_NAME', 'FIXED_CONTROLER');




/*****************************************************************************
 *                                                                           *
 * Конфигурация на EF                                                        *
 *                                                                           *
 *****************************************************************************/ 


/*****************************************************************************
 *                                                                           *
 * Клас 'core_Cache'                                                         *
 * Кеширане на обекти, променливи или масиви за определено време             *
 *                                                                           *
 * ef/core/Cache                                                             *
 *                                                                           *
 *****************************************************************************/

// Колко голям да бъде максималния обект, който се съхранява
// в кеша не-компресиран?
 # defIfNot('EF_CACHE_MAX_UNCOMPRESS', 10000);


// Максимален размер за полето на типа
 # defIfNot('EF_CACHE_TYPE_SIZE', 16);


// Максимален размер за полето на манипулатора
 # defIfNot('EF_CACHE_HANDLER_SIZE', 32);


/*****************************************************************************
 *                                                                           *
 * Клас 'core_Crypt' - Функции за двупосочно криптиране със споделен ключ    *
 *                                                                           *
 * ef/core/Crypt                                                             *
 *                                                                           *
 *****************************************************************************/

// Ключа с който ще се криптира, ако не бъде зададен експлицитно
 # defIfNot('EF_CRYPT_CODE', EF_SALT.'EF_CRYPT_CODE');


/*****************************************************************************
 *                                                                           *
 * Клас 'core_Lg' - Мениджър за многоезичен превод на интерфейса             *
 *                                                                           *
 * ef/core/Lg                                                                *
 *                                                                           *
 *****************************************************************************/

// Езикът по подразбиране е български
 # defIfNot('EF_DEFAULT_LANGUAGE', 'bg');


// Интерфейс на какви езици поддържа системата?
 # defIfNot('EF_LANGUAGES', 'bg=Български,en=Английски');


/*****************************************************************************
 *                                                                           *
 * Клас 'core_Users' - Мениджър за потребителите на системата                *
 *                                                                           *
 * ef/core/Users                                                             *
 *                                                                           *
 *****************************************************************************/

// Дефинира, ако не е, колко време записът
// за текущия потребител да е валиден в сесията
 # defIfNot('EF_USERS_CURRENT_REC_LIFETIME', 20);


// Колко секунди може да е максимално разликата
// във времето между времето изчислено при потребителя
// и това във сървъра при логване. В нормален случай
// това трябва да е повече от времето за http трансфер
// на логин формата и заявката за логване
 # defIfNot('EF_USERS_LOGIN_DELAY', 20);


// 'Подправка' за кодиране на паролите
 # defIfNot('EF_USERS_PASS_SALT', '');


// Дали да се използва имейл адресът, вместо ник
 # defIfNot('EF_USSERS_EMAIL_AS_NICK', FALSE);


// Как да се казва променливата на cookieто
 # defIfNot('EF_USERS_COOKIE', 'uid');


// Какво е минималното време в секунди, между хитовете от
// два различни IP адреса, за да не бъде блокирана сметката
 # defIfNot('EF_USERS_MIN_TIME_WITHOUT_BLOCKING', 120);


// Колко дни потребител може да не активира първоначално достъпа си
// преди да бъде изтрит
 # defIfNot('USERS_DRAFT_MAX_DAYS', 3);


/*****************************************************************************
 *                                                                           *
 *                                                                           *
 *                                                                           *
 * ef/core/boot                                                              *
 *                                                                           *
 *****************************************************************************/

// Директорията с конфигурационните файлове
 # defIfNot('EF_CONF_PATH', EF_ROOT_PATH.'/conf');


// По подразбиране от локалния хост се работи в режим DEBUG
 # defIfNot('EF_DEBUG_HOSTS', 'localhost,127.0.0.1');


// Базовото име на директорията за статичните браузърни файлове
 # defIfNot('EF_SBF', 'sbf');


// Времева зона
 # defIfNot('EF_TIMEZONE', 'Europe/Sofia');


// Директорията с външни пакети
 # defIfNot('EF_VENDORS_PATH', EF_ROOT_PATH.'/vendors');


// Базова директория, където се намират приложенията
 # defIfNot('EF_APP_BASE_PATH', EF_ROOT_PATH);


// Директорията с приложението
 # defIfNot('EF_APP_PATH', EF_APP_BASE_PATH.'/'.EF_APP_CODE_NAME);


// Базова директория, където се намират под-директориите с временни файлове
 # defIfNot('EF_TEMP_BASE_PATH', EF_ROOT_PATH.'/temp');


// Директорията с временни файлове
 # defIfNot('EF_TEMP_PATH', EF_TEMP_BASE_PATH.'/'.EF_APP_NAME);


// Базова директория, където се намират под-директориите с качените файлове
 # defIfNot('EF_UPLOADS_BASE_PATH', EF_ROOT_PATH.'/uploads');


// Директорията с качените и генерираните файлове
 # defIfNot('EF_UPLOADS_PATH', EF_UPLOADS_BASE_PATH.'/'.EF_APP_NAME);


/*****************************************************************************
 *                                                                           *
 * Клас 'page_Footer' - Долния завършек на страницата                        *
 *                                                                           *
 * ef/page/InternalFooter                                                    *
 *                                                                           *
 *****************************************************************************/

// @todo Чака за документация...
 # defIfNot('EF_LANGUAGES', 'bg');


/*****************************************************************************
 *                                                                           *
 * Клас 'plg_ExportCsv'                                                      *
 * Дава възможност за експорт към CSV на избрани полета от модела            *
 * които имат атрибут'export=Csv'                                            *
 *                                                                           *
 * ef/plg/ExportCsv                                                          *
 *                                                                           *
 *****************************************************************************/

// @todo Чака за документация...
 # defIfNot('EF_MAX_EXPORT_CNT', 1000);


/*****************************************************************************
 *                                                                           *
 * Клас  'type_Date' - Тип за дати                                           *
 *                                                                           *
 * ef/type/Date                                                              *
 *                                                                           *
 *****************************************************************************/

// Формат по подразбиране за датите
 # defIfNot('EF_DATE_FORMAT', 'd-m-YEAR');


// Формат по подразбиране за датата при тесни екрани
 # defIfNot('EF_DATE_NARROW_FORMAT', 'd-m-year');


/*****************************************************************************
 *                                                                           *
 * Клас  'type_Datetime' - Тип за време                                      *
 *                                                                           *
 * ef/type/Datetime                                                          *
 *                                                                           *
 *****************************************************************************/

// Формат по подразбиране за времевата част
 # defIfNot('EF_DATETIME_TIME_PART', ' H:i');


/*****************************************************************************
 *                                                                           *
 * Клас 'type_Double' - Тип за рационални числа                              *
 *                                                                           *
 * ef/type/Double                                                            *
 *                                                                           *
 *****************************************************************************/

// Колко цифри след запетаята да показваме по подразбиране?
 # defIfNot('EF_NUMBER_DECIMALS', 4);


// Кой символ за десетична точка да използваме?
 # defIfNot('EF_NUMBER_DEC_POINT', ',');


// Кой символ да използваме за разделител на хилядите?
 # defIfNot('EF_NUMBER_THOUSANDS_SEP', ' ');


/*****************************************************************************
 *                                                                           *
 * Клас  'type_Int' - Тип за цели числа                                      *
 *                                                                           *
 * ef/type/Int                                                               *
 *                                                                           *
 *****************************************************************************/

// Кой символ да използваме за разделител на хилядите?
 # defIfNot('EF_NUMBER_THOUSANDS_SEP', ' ');


/*****************************************************************************
 *                                                                           *
 * Клас  'type_Key' - Ключ към ред от MVC модел                              *
 *                                                                           *
 * ef/type/Key                                                               *
 *                                                                           *
 *****************************************************************************/

// @todo Чака за документация...
 # defIfNot('TYPE_KEY_MAX_SUGGESTIONS', 1000);


/*****************************************************************************
 *                                                                           *
 * Клас  'type_Password' - Тип за парола                                     *
 *                                                                           *
 * ef/type/Password                                                          *
 *                                                                           *
 *****************************************************************************/

// @todo Чака за документация...
 # defIfNot('EF_PASS_NO_CHANGE', 'no_change');


/*****************************************************************************
 *                                                                           *
 * Клас  'type_Percent' - Тип за проценти                                    *
 *                                                                           *
 * ef/type/Percent                                                           *
 *                                                                           *
 *****************************************************************************/

// @todo Чака за документация...
 # defIfNot('EF_PERCENT_DECIMALS', 2);



/*****************************************************************************
 *                                                                           *
 * Конфигурация на BGERP                                                     *
 *                                                                           *
 *****************************************************************************/ 


/*****************************************************************************
 *                                                                           *
 * Мениджира периодите в счетоводната система                                *
 *                                                                           *
 * bgerp/acc/Periods                                                         *
 *                                                                           *
 *****************************************************************************/

// Задаване начало и край на първия регистриран период
 # defIfNot('BGERP_FIRST_PERIOD_START', '[#BGERP_FIRST_PERIOD_START#]');


// Край на първия период в счетоводната система
 # defIfNot('BGERP_FIRST_PERIOD_END', '[#BGERP_FIRST_PERIOD_END#]');


/*****************************************************************************
 *                                                                           *
 * Добавя бланка в началото на документите, които се изпращат или принтират  *
 *                                                                           *
 * bgerp/bgerp/plg/Blank                                                     *
 *                                                                           *
 *****************************************************************************/

// @todo Чака за документация...
 # defIfNot('BGERP_COMPANY_LOGO_BG', 'bgerp/img/companyLogoBg.png');


/*****************************************************************************
 *                                                                           *
 * Шаблон за писма за масово разпращане                                      *
 *                                                                           *
 * bgerp/blast/Emails                                                        *
 *                                                                           *
 *****************************************************************************/

// Текст за отписване от информационните съобщение
 # defIfNot('BGERP_BLAST_UNSUBSCRIBE', 'Искате ли да премахнете имейл-а си от листата за получаване на информационни съобщения.');


// Текст, който се показва, ако не може да се намери имейл адреса в системата
 # defIfNot('BGERP_BLAST_NO_MAIL', 'Не може да се намери имейл адреса Ви.');


// Teкст, който се показва когато премахнем имейл-а от блокираните
 # defIfNot('BGERP_BLAST_SUCCESS_ADD', 'Имейлът Ви е добавен в списъка за информационни съобщения. Искате ли да го премахнете?');


// Текст, който се показва когато добавим имейл-а в списъка на блокираните имейли
 # defIfNot('BGERP_BLAST_SUCCESS_REMOVED', 'Имейлът Ви е премахнат от списъка за информационни съобщения. Искате ли да добавите имейл-а си в листата?');


/*****************************************************************************
 *                                                                           *
 * Клас 'cams_Records' -                                                     *
 *                                                                           *
 * bgerp/cams/Records                                                        *
 *                                                                           *
 *****************************************************************************/

// Път до директория, където ще се съхраняват записите от камерите
 # defIfNot('CAMS_VIDEOS_PATH', EF_UPLOADS_PATH."/cams/videos");


// Път до директория, където ще се записват jpeg превютата
 # defIfNot('CAMS_IMAGES_PATH', EF_UPLOADS_PATH."/cams/images");


// Директория за flv файловете
 # defIfNot('SBF_CAMS_FLV_DIR', "_cams/flv");


// Път до директория, където ще се записват flv файловете
 # defIfNot('SBF_CAMS_FLV_PATH', EF_SBF_PATH.'/'.SBF_CAMS_FLV_DIR);


// Колко да е продължителността на един клип в секунди
 # defIfNot('CAMS_CLIP_DURATION', 5*60);


// Колко е продължителността на конвертирането на един клип в секунди
 # defIfNot('CAMS_CLIP_TO_FLV_DURATION', round(cams_CLIP_DURATION/30));


// Колко клипа да показва на страница при широк екран
 # defIfNot('CAMS_CLIPS_PER_WIDE_PAGE', 144);


// Колко клипа да показва на страница при тесен екран
 # defIfNot('CAMS_CLIPS_PER_NARROW_PAGE', 12);


// Колко клипа да показва на ред при широк екран
 # defIfNot('CAMS_CLIPS_PER_WIDE_ROW', 6);


// Колко клипа да показва на ред при тесен екран
 # defIfNot('CAMS_CLIPS_PER_NARROW_ROW', 1);


// Колко да е минималното дисково пространство
 # defIfNot('CAMS_MIN_DISK_SPACE', 100*1024*1024*1024);


/*****************************************************************************
 *                                                                           *
 * Фирми                                                                     *
 *                                                                           *
 * bgerp/crm/Companies                                                       *
 *                                                                           *
 *****************************************************************************/

// Константи за инициализиране на таблицата с контактите
 # defIfNot('BGERP_OWN_COMPANY_ID', '1');


// Име на собствената компания (тази за която ще работи bgERP)
 # defIfNot('BGERP_OWN_COMPANY_NAME', 'Моята Фирма ООД');


// Държавата на собствената компания (тази за която ще работи bgERP)
 # defIfNot('BGERP_OWN_COMPANY_COUNTRY', 'Bulgaria');


/*****************************************************************************
 *                                                                           *
 * Клас 'currency_CurrencyRates' -                                           *
 *                                                                           *
 * bgerp/currency/CurrencyRates                                              *
 *                                                                           *
 *****************************************************************************/

// Задаване на основна валута
 # defIfNot('BGERP_BASE_CURRENCY', 'BGN');


/*****************************************************************************
 *                                                                           *
 * Генериране на PDF файлове от HTML файл чрез web kit                       *
 *                                                                           *
 * bgerp/doc/PdfCreator                                                      *
 *                                                                           *
 *****************************************************************************/

// Кофата по подразбиране за генерирани pdf' и
 # defIfNot('BGERP_PDF_BUCKET', 'pdf');


// Кой пакет да използваме за генериране на PDF от HTML ?
 # defIfNot('BGERP_PDF_GENERATOR', 'webkittopdf');


/*****************************************************************************
 *                                                                           *
 * class dma_Setup                                                           *
 *                                                                           *
 * bgerp/doc/Setup                                                           *
 *                                                                           *
 *****************************************************************************/

// Роля за основен екип
 # defIfNot('BGERP_ROLE_HEADQUARTER', 'Headquarter');


/*****************************************************************************
 *                                                                           *
 * Входящи писма                                                             *
 *                                                                           *
 * bgerp/email/Incomings                                                     *
 *                                                                           *
 *****************************************************************************/

// Максимално време за еднократно фетчване на писма
 # defIfNot('IMAP_MAX_FETCHING_TIME', 30);


// Максималната разрешена памет за използване
 # defIfNot('MAX_ALLOWED_MEMORY', '800M');


// Шаблон за име на папките, където отиват писмата от дадена държава и неподлежащи на
// по-адекватно сортиране
 # defIfNot('UNSORTABLE_COUNTRY_EMAILS', 'Unsorted - %s');


/*****************************************************************************
 *                                                                           *
 * Клас 'email_Pop3' - Използване на pop3                                    *
 *                                                                           *
 * bgerp/email/Pop3                                                          *
 *                                                                           *
 *****************************************************************************/

// Максималното време за изчакване на буфера
 # defIfNot('POP3_TIMEOUT', 2);


/*****************************************************************************
 *                                                                           *
 * Клас 'email_UserInboxPlg'                                                 *
 * Създава пощенска кутия след създаване на нов потребител                   *
 *                                                                           *
 * bgerp/email/UserInboxPlg                                                  *
 *                                                                           *
 *****************************************************************************/

// Роля за основен екип
 # defIfNot('BGERP_ROLE_HEADQUARTER', 'Headquarter');


/*****************************************************************************
 *                                                                           *
 * Създаване и изпращане на факсове                                          *
 *                                                                           *
 * bgerp/fax/Outgoings                                                       *
 *                                                                           *
 *****************************************************************************/

// Максималният допустим брой на прикачените файлове и документи при изпращане на факсове
 # defIfNot('MAX_ALLOWED_ATTACHMENTS_IN_FAX', 10);


/*****************************************************************************
 *                                                                           *
 * Факс адреси                                                               *
 *                                                                           *
 * bgerp/fax/Services                                                        *
 *                                                                           *
 *****************************************************************************/

// Шаблона, който се използва за факса на получателя
 # defIfNot('RECIPIENT_FAX_NUMBER_TEMPLATE', 'RECIPIENT_FAX');


/*****************************************************************************
 *                                                                           *
 * Клас 'page_InternalFooter' - Долния завършек на страницата                *
 *                                                                           *
 * bgerp/page/InternalFooter                                                 *
 *                                                                           *
 *****************************************************************************/

// @todo Чака за документация...
 # defIfNot('EF_LANGUAGES', 'bg,en');



/*****************************************************************************
 *                                                                           *
 * Конфигурация на VENDORS                                                   *
 *                                                                           *
 *****************************************************************************/ 


/*****************************************************************************
 *                                                                           *
 * Клас 'avatar_Plugin' -                                                    *
 *                                                                           *
 * vendors/avatar/Plugin                                                     *
 *                                                                           *
 *****************************************************************************/

// @todo Чака за документация...
 # defIfNot('AVATAR_DIR', EF_DOWNLOAD_DIR.'/'.'AVATAR');


// @todo Чака за документация...
 # defIfNot('AVATAR_URL', EF_DOWNLOAD_ROOT.'/'.'AVATAR');


/*****************************************************************************
 *                                                                           *
 * Клас 'barcode_Qr' - Генериране на QR изображения                          *
 *                                                                           *
 * vendors/barcode/Qr                                                        *
 *                                                                           *
 *****************************************************************************/

// @todo Чака за документация...
 # defIfNot('BARCODE_SALT', EF_SALT.'_BARCODE');


/*****************************************************************************
 *                                                                           *
 * Клас 'captcha_Type' -                                                     *
 *                                                                           *
 * vendors/captcha/Type                                                      *
 *                                                                           *
 *****************************************************************************/

// Колко минути да е активна информацията в кеша?
 # defIfNot('CAPTCHA_LIFETIME', 10);


// Колко символа да е дълга капчата?
 # defIfNot('CAPTCHA_LENGTH', 4);


// Колко да са високи символите?
 # defIfNot('CAPTCHA_HEIGHT', 28);


// Колко да е широко изображението?
 # defIfNot('CAPTCHA_WIDTH', round(0.70*CAPTCHA_HEIGHT*CAPTCHA_LENGTH));


// С какъв тип да се правят записите в кеша?
 # defIfNot('CAPTCHA_CACHE_TYPE', 'Captcha');


/*****************************************************************************
 *                                                                           *
 * Клас 'chosen_Plugin' - избор на дата                                      *
 *                                                                           *
 * vendors/chosen/Plugin                                                     *
 *                                                                           *
 *****************************************************************************/

// Пътя до външния код на chosen
 # defIfNot('CHOSEN_PATH', 'chosen/0.9.3');


// Минималния брой елементи, за които няма да сработи Chosen
 # defIfNot('EF_MIN_COUNT_LIST_CHOSEN', 16);


/*****************************************************************************
 *                                                                           *
 * Клас 'hclean_HtmlPurifyPlg' - Изчистване на HTML полета                   *
 *                                                                           *
 * vendors/dompdf/Converter                                                  *
 *                                                                           *
 *****************************************************************************/

// @todo Чака за документация...
 # defIfNot('DOMPDF_VER', '3.0');


// Дефинира име на папка в която ще се съхраняват временните данни данните
 # defIfNot('DOMPDF_TEMP_DIR', EF_TEMP_PATH."/dompdf");


// @todo Чака за документация...
 # defIfNot('DOMPDF_DPI', "120");


// @todo Чака за документация...
 # defIfNot('DOMPDF_ENABLE_REMOTE', TRUE);


/*****************************************************************************
 *                                                                           *
 * Клас 'drdata_Emails' -                                                    *
 *                                                                           *
 * vendors/drdata/Emails                                                     *
 *                                                                           *
 *****************************************************************************/

// @todo Чака за документация...
 # defIfNot('SENDER_HOST', "colocation.download.bg");


// @todo Чака за документация...
 # defIfNot('SENDER_EMAIL', "team@extrapack.com");


/*****************************************************************************
 *                                                                           *
 * Клас 'editwatch_Editors' -                                                *
 *                                                                           *
 * vendors/editwatch/Editors                                                 *
 *                                                                           *
 *****************************************************************************/

// Колко секунди да пази записите в таблицата минимално
 # defIfNot('EDITWATCH_REC_LIFETIME', 5*60);


/*****************************************************************************
 *                                                                           *
 * Клас 'core_Expert'                                                        *
 *                                                                           *
 * vendors/expert/Expert                                                     *
 *                                                                           *
 *****************************************************************************/

// Къде да се съхранява състоянието на експертизата?
 # defIfNot('EXPERT_SAVE_STATE_IN_CACHE', TRUE);


// Дефинира колко минути е 'живо' състоянието
 # defIfNot('EXPERT_STATE_LIFETIME', 45);


// Тип на записа в кеша
 # defIfNot('EXPERT_CACHE_TYPE', 'Expert');


/*****************************************************************************
 *                                                                           *
 * Клас 'fancybox_Fancybox'                                                  *
 *                                                                           *
 * vendors/fancybox/Fancybox                                                 *
 *                                                                           *
 *****************************************************************************/

// Път до външния пакет
 # defIfNot('FANCYBOX_PATH', 'fancybox/1.3.4');


/*****************************************************************************
 *                                                                           *
 * Показва стартираните процеси                                              *
 *                                                                           *
 * vendors/fconv/Processes                                                   *
 *                                                                           *
 *****************************************************************************/

// @todo Чака за документация...
 # defIfNot('FCONV_HANDLER_LEN', 8);


/*****************************************************************************
 *                                                                           *
 * Клас 'fileman_Data' - Указател към данните за всеки файл                  *
 *                                                                           *
 * vendors/fileman/Data                                                      *
 *                                                                           *
 *****************************************************************************/

// Пътя до директорията за файловете е общ за всички инсталирани приложения
 # defIfNot('FILEMAN_UPLOADS_PATH', substr(EF_UPLOADS_PATH,0,strrpos(EF_UPLOADS_PATH,'/'));


/*****************************************************************************
 *                                                                           *
 * Клас 'fileman_Download' -                                                 *
 *                                                                           *
 * vendors/fileman/Download                                                  *
 *                                                                           *
 *****************************************************************************/

// @todo Чака за документация...
 # defIfNot('EF_DOWNLOAD_ROOT', '_dl_');


// @todo Чака за документация...
 # defIfNot('EF_DOWNLOAD_DIR', EF_INDEX_PATH.'/'.EF_SBF.'/'.EF_APP_NAME.'/'.EF_DOWNLOAD_ROOT);


// Шаблон за манипулатора на файла при download
 # defIfNot('EF_DOWNLOAD_PREFIX_PTR', '$*****');


// Минималната големина на файла в байтове, за който ще се показва размера на файла след името му
// в narrow режим. По подразбиране е 100KB
 # defIfNot('LINK_NARROW_MIN_FILELEN_SHOW', 102400);


/*****************************************************************************
 *                                                                           *
 * Клас 'fileman_Files' -                                                    *
 *                                                                           *
 * vendors/fileman/Files                                                     *
 *                                                                           *
 *****************************************************************************/

// Каква да е дължината на манипулатора на файла?
 # defIfNot('FILEMAN_HANDLER_PTR', '$*****');


/*****************************************************************************
 *                                                                           *
 * Клас 'fileman_SetExtensionPlg'                                            *
 * Проверка и коригиране на разширението на файла                            *
 *                                                                           *
 * vendors/fileman/SetExtensionPlg                                           *
 *                                                                           *
 *****************************************************************************/

// Задава командата за определяне на mime типа
// Константата е дефинирана по подразбиране само в Линукс
 # defIfNot('EF_EXTENSION_FILE_PROGRAM', 'file');


/*****************************************************************************
 *                                                                           *
 * Клас 'flexpaper_Render'                                                   *
 *                                                                           *
 * vendors/flexpaper/Render                                                  *
 *                                                                           *
 *****************************************************************************/

// Път до външния файл
 # defIfNot('FLEXPAPER_PATH', sbf("flexpaper/1.4.5/FlexPaperViewer.swf"));


/*****************************************************************************
 *                                                                           *
 * Генерира необходимият код за плейване на flv файлове                      *
 *                                                                           *
 * vendors/flvplayer/Embedder                                                *
 *                                                                           *
 *****************************************************************************/

// @todo Чака за документация...
 # defIfNot('FLVPLAYER_PATH', sbf("flvplayer/1.6.0/player_flv_maxi.swf"));


/*****************************************************************************
 *                                                                           *
 * Клас 'hclean_Purifier' - Пречистване на HTML                              *
 *                                                                           *
 * vendors/hclean/Purifier                                                   *
 *                                                                           *
 *****************************************************************************/

// Папка за съхранение на временните файлове
 # defIfNot('PURIFIER_TEMP_PATH', EF_TEMP_PATH.'/purifer');


/*****************************************************************************
 *                                                                           *
 * Клас 'jqdatepick_Plugin' - избор на дата                                  *
 *                                                                           *
 * vendors/jqdatepick/Plugin                                                 *
 *                                                                           *
 *****************************************************************************/

// @todo Чака за документация...
 # defIfNot('JQDATEPICKER_VERSION', 'v4.0.6');


/*****************************************************************************
 *                                                                           *
 * Клас 'jsgauge_Gauge'                                                      *
 *                                                                           *
 * vendors/jsgauge/Gauge                                                     *
 *                                                                           *
 *****************************************************************************/

// Път до външния файл
 # defIfNot('GAUGE_PATH', 'jsgauge/0.4.1');


/*****************************************************************************
 *                                                                           *
 * Клас 'keyboard_Plugin' -                                                  *
 *                                                                           *
 * vendors/keyboard/Plugin                                                   *
 *                                                                           *
 *****************************************************************************/

// @todo Чака за документация...
 # defIfNot('VKI_VERSION', '1.28');


/*****************************************************************************
 *                                                                           *
 * SMS-и през Мобио                                                          *
 *                                                                           *
 * vendors/mobio/SmsPlugin                                                   *
 *                                                                           *
 *****************************************************************************/

// Урл за изпращане на СМС-и през Мобио
 # defIfNot('MOBIO_URL', '');


/*****************************************************************************
 *                                                                           *
 * Хранилището за перманентни данни.                                         *
 *                                                                           *
 * vendors/permanent/Data                                                    *
 *                                                                           *
 *****************************************************************************/

// Какъв е максималния размер на некомпресираните данни в байтове
 # defIfNot('DATA_MAX_UNCOMPRESS', 10000);


/*****************************************************************************
 *                                                                           *
 * Клас 'php_Formater' - Форматер за приложения на EF                        *
 *                                                                           *
 * vendors/php/Test                                                          *
 *                                                                           *
 *****************************************************************************/

// Обща директория на bgerp, vendors, ef. Използва се за едновременно форматиране на трите пакета.
 # defIfNot('EF_ALL_PATH', EF_ROOT_PATH.'/all');


/*****************************************************************************
 *                                                                           *
 * Клас от EF, който агрегира PHP Mailer Lite                                *
 *                                                                           *
 * vendors/phpmailer/Instance                                                *
 *                                                                           *
 *****************************************************************************/

// Подразбиращата се кодировка на съобщенията
 # defIfNot('PML_CHARSET', 'utf-8');


// Ник-а на изпращача по подразбиране
 # defIfNot('PML_DEF_NICK', 'support');


// Адреса във 'From' хедър-а на съобщението
 # defIfNot('PML_FROM_EMAIL', PML_DEF_NICK.'@'.$_SERVER['SERVER_NAME']);


// Името във 'From' хедър-а на съобщението
 # defIfNot('PML_FROM_NAME', EF_APP_TITLE.' '.mb_convert_case(PML_DEF_NICK,MB_CASE_TITLE,PML_CHARSET));


// Адреса на изпращача (Return-Path) на съобщението
 # defIfNot('PML_SENDER', PML_FROM_EMAIL);


// Какъв да е метода за изпращане на писма?
// ("mail", "sendmail", or "smtp")
 # defIfNot('PML_MAILER', 'sendmail');


// Къде се намира Sendmail?
 # defIfNot('SENDMAIL_PATH', '/usr/sbin/sendmail');


// Дефинираме пътя до кода на PHP_Mailer
 # defIfNot('PML_CLASS', '5.2/class.phpmailer.php');


// Да изпраща ли по единично писмата от адресите в 'To:'
 # defIfNot('PML_SINGLE_TO', FALSE);


/*****************************************************************************
 *                                                                           *
 * Клас  'physics_HumidityType' - Тип за температура                         *
 *                                                                           *
 * vendors/physics/HumidityType                                              *
 *                                                                           *
 *****************************************************************************/

// Колко цифри след запетаята да се показват
 # defIfNot('EF_HUMIDITYTYPE_DECIMALS', 0);


/*****************************************************************************
 *                                                                           *
 * Клас  'physics_PressureType' - Тип за температура                         *
 *                                                                           *
 * vendors/physics/PressureType                                              *
 *                                                                           *
 *****************************************************************************/

// Колко цифри след запетаята да се показват
 # defIfNot('EF_PRESSURETYPE_DECIMALS', 1);


// Мерната единица по подразбиране
 # defIfNot('EF_DEFAULT_UNIT_PRESSURE', 'bar');


/*****************************************************************************
 *                                                                           *
 * Клас  'physics_TemperatureType' - Тип за температура                      *
 *                                                                           *
 * vendors/physics/TemperatureType                                           *
 *                                                                           *
 *****************************************************************************/

// Колко цифри след запетаята да се показват
 # defIfNot('EF_TEMPERATURETYPE_DECIMALS', 2);


// Мерната единица по подразбиране
 # defIfNot('EF_DEFAULT_UNIT', '°C');


/*****************************************************************************
 *                                                                           *
 * SMS-и през Pro-SMS                                                        *
 *                                                                           *
 * vendors/prosms/Plugin                                                     *
 *                                                                           *
 *****************************************************************************/

// @todo Чака за документация...
 # defIfNot('PROSMS_URL', '');


// @todo Чака за документация...
 # defIfNot('PROSMS_USER', '');


// @todo Чака за документация...
 # defIfNot('PROSMS_PASS', '');


/*****************************************************************************
 *                                                                           *
 * Клас 'recently_Values'                                                    *
 *                                                                           *
 * vendors/recently/Values                                                   *
 *                                                                           *
 *****************************************************************************/

// Максимален брой за предложенията за последно използвани стойности на поле
 # defIfNot('RECENTLY_MAX_SUGGESTION', 20);


// Максимален брой дни за запазване на стойност след нейната последна употреба
 # defIfNot('RECENTLY_MAX_KEEPING_DAYS', 60);


/*****************************************************************************
 *                                                                           *
 * Клас 'thumbnail_Thumbnail' -                                              *
 *                                                                           *
 * vendors/thumbnail/Thumbnail                                               *
 *                                                                           *
 *****************************************************************************/

// @todo Чака за документация...
 # defIfNot('THUMBNAIL_FOLDER', EF_DOWNLOAD_DIR.'/'.'TB');


// @todo Чака за документация...
 # defIfNot('THUMBNAIL_URL', EF_DOWNLOAD_ROOT.'/'.'TB');


/*****************************************************************************
 *                                                                           *
 * Генериране на PDF файлове от HTML файл чрез web kit                       *
 *                                                                           *
 * vendors/webkittopdf/Converter                                             *
 *                                                                           *
 *****************************************************************************/

// Дефинира име на папка в която ще се съхраняват временните данни данните
 # defIfNot('WEBKIT_TO_PDF_TEMP_DIR', EF_TEMP_PATH."/webkittopdf");


// Изпълнимия файл на програмата
 # defIfNot('WEBKIT_TO_PDF_BIN', "/usr/bin/wkhtmltopdf");


// Оказва дали да се изплни помпщната програма (xvfb-run)
 # defIfNot('WEBKIT_TO_PDF_XVFB_RUN', TRUE);


// xvfb-run - Ширина на екрана
 # defIfNot('WEBKIT_TO_PDF_SCREEN_WIDTH', "640");


// xvfb-run - Височина на екрана
 # defIfNot('WEBKIT_TO_PDF_SCREEN_HEIGHT', "480");


// xvfb-run - Дълбочина на цвета
 # defIfNot('WEBKIT_TO_PDF_SCREEN_BIT', "16");


/*****************************************************************************
 *                                                                           *
 * XMPP съобщения                                                            *
 *                                                                           *
 * vendors/xmpphp/Sender                                                     *
 *                                                                           *
 *****************************************************************************/

// @todo Чака за документация...
 # defIfNot('XMPPHP_VERSION', '0.1rc2-r77');


// @todo Чака за документация...
 # defIfNot('XMPPHP_SERVER', 'talk.google.com');


// @todo Чака за документация...
 # defIfNot('XMPPHP_PORT', '5222');


// @todo Чака за документация...
 # defIfNot('XMPPHP_USER', '');


// @todo Чака за документация...
 # defIfNot('XMPPHP_PASSWORD', '');


// @todo Чака за документация...
 # defIfNot('XMPPHP_DOMAIN', 'gmail.com');


