

/*****************************************************************************

 *                                                                           *

 *      Примерен конфигурационен файл за системата                           *

 *                                                                           *

 *      След като се попълнят стойностите на константите, този файл          *

 *      трябва да бъде записан в [conf] директорията под име:                *

 *      [име на приложението].cfg.php                                        *

 *                                                                           *

 *****************************************************************************/ 




/*****************************************************************************

 *                                                                           *

 * Задължително въведете стойности на следните константи                     *

 *                                                                           *

 *****************************************************************************/ 


// Името на приложението. Използва се за определяне на други константи

   DEFINE('EF_APP_NAME', );



// Лого на фирмата

   DEFINE('BGERP_COMPANY_LOGO', );



// Име на базата данни. По подразбиране е същото, като името на приложението

   DEFINE('EF_DB_NAME', );



// Потребителско име. По подразбиране е същото, като името на приложението

   DEFINE('EF_DB_USER', );



// По-долу трябва да се постави реалната парола за връзка

// с базата данни на потребителят дефиниран в предходния ред

   DEFINE('EF_DB_PASS', ); 

   

// Секретен ключ използван за кодиране в рамките на системата

// Той трябва да е различен, за различните инсталации на системата

// Моля сменето стойността, ако правите нова инсталация.

// След като веднъж е установен, този параметър не трябва да се променя

   DEFINE('EF_SALT', );



// Имейла по подразбиране

   DEFINE('BGERP_DEFAULT_EMAIL_FROM', );



// Домейн  по подразбиране

   DEFINE('BGERP_DEFAULT_EMAIL_DOMAIN', );



// Пощенска кутия по подразбиране

   DEFINE('BGERP_DEFAULT_EMAIL_USER', );



// Хост по подразбиране

   DEFINE('BGERP_DEFAULT_EMAIL_HOST', );



// Парола по подразбиране

   DEFINE('BGERP_DEFAULT_EMAIL_PASSWORD', );

   




/*****************************************************************************

 *                                                                           *

 * Параметри за връзка с базата данни                                        *

 *                                                                           *

 *****************************************************************************/ 



// Сървъра за на базата данни

   DEFINE('EF_DB_HOST', 'localhost');

 

// Кодировка на забата данни

   DEFINE('EF_DB_CHARSET', 'utf8');



/*****************************************************************************

 *                                                                           *

 * Пътища до някои важни части от системата                                  *

 *                                                                           *

 *****************************************************************************/ 



// Път по подразбиране за пакетите от 'vendors'

 # DEFINE('EF_VENDORS_PATH', EF_ROOT_PATH . '/vendors');



// Път по подразбиране за пакетите от 'private'

 # DEFINE('EF_PRIVATE_PATH', EF_ROOT_PATH . '/private');



// Базова директория, където се намират по-директориите за

// временните файлове. По подразбиране е в

// EF_ROOT_PATH/temp

 # DEFINE( 'EF_TEMP_BASE_PATH', 'PATH_TO_FOLDER');



// Базова директория, където се намират по-директориите за

// потребителски файлове. По подразбиране е в

// EF_ROOT_PATH/uploads

 # DEFINE( 'EF_UPLOADS_BASE_PATH', 'PATH_TO_FOLDER');



// Твърдо, фиксирано име на мениджъра с контролерните функции. 

// Ако се укаже, цялотоможе да има само един такъв 

// мениджър функции. Това е удобство за специфични приложения, 

// при които не е добре името на мениджъра да се вижда в URL-то

 # DEFINE('EF_CTR_NAME', 'FIXED_CONTROLER');



// Твърдо, фиксирано име на екшън (контролерна функция). 

// Ако се укаже, от URL-то се изпускат екшъните.

 # DEFINE('EF_ACT_NAME', 'FIXED_CONTROLER');



// Базова директория, където се намират приложенията

 # DEFINE('EF_APP_BASE_PATH', 'PATH_TO_FOLDER');



// Директорията с конфигурационните файлове

 # DEFINE('EF_CONF_PATH', EF_ROOT_PATH . '/conf');






/*****************************************************************************

 *                                                                           *

 * Конфигурация на EF                                                        *

 *                                                                           *

 *****************************************************************************/ 


/*****************************************************************************
 *                                                                           *
 * Клас 'core_Cache'                                                         *
 * Кеширане на обекти, променливи или масиви за определено време             *
 *                                                                           *
 * ef/core/Cache                                                             *
 *                                                                           *
 *****************************************************************************/

// Колко голям да бъде максималния обект, който се съхранява
// в кеша не-компресиран?
 # DEFINE('EF_CACHE_MAX_UNCOMPRESS', 10000);


// Максимален размер за полето на типа
 # DEFINE('EF_CACHE_TYPE_SIZE', 16);


// Максимален размер за полето на манипулатора
 # DEFINE('EF_CACHE_HANDLER_SIZE', 32);


/*****************************************************************************
 *                                                                           *
 * Клас 'core_Crypt' - Функции за двупосочно криптиране със споделен ключ    *
 *                                                                           *
 * ef/core/Crypt                                                             *
 *                                                                           *
 *****************************************************************************/

// Ключа с който ще се криптира, ако не бъде зададен експлицитно
 # DEFINE('EF_CRYPT_CODE', EF_SALT.'EF_CRYPT_CODE');


/*****************************************************************************
 *                                                                           *
 * Клас 'core_Db' - Манипулиране на MySQL-ски бази данни                     *
 *                                                                           *
 * ef/core/Db                                                                *
 *                                                                           *
 *****************************************************************************/

// Задава кодировката на базата данни по подразбиране
 # DEFINE('EF_DB_CHARSET', 'utf8');


// Задава колацията на базата данни по подразбиране
 # DEFINE('EF_DB_COLLATION', 'utf8_bin');


// Задава кодировката на клиента (PHP скрипта) за базата данни по подразбиране
 # DEFINE('EF_DB_CHARSET_CLIENT', 'utf8');


/*****************************************************************************
 *                                                                           *
 * Клас 'core_Lg' - Мениджър за многоезичен превод на интерфейса             *
 *                                                                           *
 * ef/core/Lg                                                                *
 *                                                                           *
 *****************************************************************************/

// Езикът по подразбиране е български
 # DEFINE('EF_DEFAULT_LANGUAGE', 'bg');


/*****************************************************************************
 *                                                                           *
 * Клас 'core_Mode' ['Mode'] - Вътрешно състояние по време на хита и сесията *
 *                                                                           *
 * ef/core/Mode                                                              *
 *                                                                           *
 *****************************************************************************/

// @todo Чака за документация...
 # DEFINE('EF_MODE_SESSION_VAR', 'pMode');


/*****************************************************************************
 *                                                                           *
 * Клас 'core_Mvc' - Манипулации на модела (таблица в db)                    *
 *                                                                           *
 * ef/core/Mvc                                                               *
 *                                                                           *
 *****************************************************************************/

// По подразбиране, няма префикс преди името на таблицата
 # DEFINE('EF_DB_TABLE_PREFIX', '');


/*****************************************************************************
 *                                                                           *
 * Клас 'core_Roles' - Мениджър за ролите на потребителите                   *
 *                                                                           *
 * ef/core/Roles                                                             *
 *                                                                           *
 *****************************************************************************/

// С каква роля да получават новите потребители по подразбиране?
 # DEFINE('EF_ROLES_DEFAULT', 'user');


/*****************************************************************************
 *                                                                           *
 * Клас 'core_Users' - Мениджър за потребителите на системата                *
 *                                                                           *
 * ef/core/Users                                                             *
 *                                                                           *
 *****************************************************************************/

// Дефинира, ако не е, колко време записът
// за текущия потребител да е валиден в сесията
 # DEFINE('EF_USERS_CURRENT_REC_LIFETIME', 20);


// Колко секунди може да е максимално разликата
// във времето между времето изчислено при потребителя
// и това във сървъра при логване. В нормален случай
// това трябва да е повече от времето за http трансфер
// на логин формата и заявката за логване
 # DEFINE('EF_USERS_LOGIN_DELAY', 20);


// 'Подправка' за кодиране на паролите
 # DEFINE('EF_USERS_PASS_SALT', EF_SALT);


// Дали да се използва имейл адресът, вместо ник
 # DEFINE('EF_USSERS_EMAIL_AS_NICK', FALSE);


// Как да се казва променливата на cookieто
 # DEFINE('EF_USERS_COOKIE', 'uid');


// Какво е минималното време в секунди, между хитовете от
// два различни IP адреса, за да не бъде блокирана сметката
 # DEFINE('EF_USERS_MIN_TIME_WITHOUT_BLOCKING', 120);


// Колко дни потребител може да не активира първоначално достъпа си
// преди да бъде изтрит
 # DEFINE('USERS_DRAFT_MAX_DAYS', 3);


/*****************************************************************************
 *                                                                           *
 *                                                                           *
 *                                                                           *
 * ef/core/boot                                                              *
 *                                                                           *
 *****************************************************************************/

// Директорията с конфигурационните файлове
 # DEFINE('EF_CONF_PATH', EF_ROOT_PATH.'/conf');


// По подразбиране от локалния хост се работи в режим DEBUG
 # DEFINE('EF_DEBUG_HOSTS', 'localhost,127.0.0.1');


// Базовото име на директорията за статичните браузърни файлове
 # DEFINE('EF_SBF', 'sbf');


// Името на приложението. Използва се за определяне на други константи.
 # DEFINE('EF_APP_NAME', $_GET['App']);


// Времева зона
 # DEFINE('EF_TIMEZONE', function_exists("date_default_timezone_get");


// Директорията с външни пакети
 # DEFINE('EF_VENDORS_PATH', EF_ROOT_PATH.'/vendors');


// Базова директория, където се намират приложенията
 # DEFINE('EF_APP_BASE_PATH', EF_ROOT_PATH);


// Директорията с приложението
 # DEFINE('EF_APP_PATH', EF_APP_BASE_PATH.'/'.EF_APP_CODE_NAME);


// Базова директория, където се намират под-директориите с временни файлове
 # DEFINE('EF_TEMP_BASE_PATH', EF_ROOT_PATH.'/temp');


// Директорията с временни файлове
 # DEFINE('EF_TEMP_PATH', EF_TEMP_BASE_PATH.'/'.EF_APP_NAME);


// Базова директория, където се намират под-директориите с качените файлове
 # DEFINE('EF_UPLOADS_BASE_PATH', EF_ROOT_PATH.'/uploads');


// Директорията с качените и генерираните файлове
 # DEFINE('EF_UPLOADS_PATH', EF_UPLOADS_BASE_PATH.'/'.EF_APP_NAME);


/*****************************************************************************
 *                                                                           *
 * Клас 'plg_ExportCsv'                                                      *
 * Дава възможност за експорт към CSV на избрани полета от модела            *
 * които имат атрибут'export=Csv'                                            *
 *                                                                           *
 * ef/plg/ExportCsv                                                          *
 *                                                                           *
 *****************************************************************************/

// @todo Чака за документация...
 # DEFINE('EF_MAX_EXPORT_CNT', 1);


/*****************************************************************************
 *                                                                           *
 * Клас 'plg_UserReg' - Самостоятелна регистрация на потребителите           *
 *                                                                           *
 * ef/plg/UserReg                                                            *
 *                                                                           *
 *****************************************************************************/

// Каква е минималната дължина за паролата?
 # DEFINE('USERREG_MIN_PASS', 5);


// Типа на записите в кеша
 # DEFINE('USERREG_CACHE_TYPE', 'UserReg');


// Съобщение, което получава потребителя след регистрация
 # DEFINE('USERREG_THANK_FOR_REG_MSG', "Благодарим ви за регистрациятa|*!"."<br><br>|На посочения от вас адрес беше изпратено писмо със заглавие \"Access activation\"|*."."<br>|В него се съдържа линк, чрез който трябва да зададете вашата парола за|* ".EF_APP_TITLE." ."."<br><br>|Поздрави от екипа!");


// Съобщение, което получава потребителя след заявка за смяна на паролата
 # DEFINE('USERREG_THANK_FOR_RESET_PASS_MSG', "Заявката за смяната на паролата е приета|*!"."<br><br>|На посочения от вас адрес беше изпратено писмо със заглавие \"Reset Your password\"|*."."<br>|В него се съдържа линк, чрез който трябва да зададете вашата нова парола за|* ".EF_APP_TITLE." ."."<br><br>|Поздрави от екипа!");


// Писмо до потребителя за активация
 # DEFINE('USERREG_ACTIVATION_EMAIL', "|\nDear |*[#names#]|,"."\n"."\nThank you for your registration."."\n"."\nTo setup your password, please use following URL:"."\n"."\n|*[#url#]|"."\n"."\nThe above URL will expired after [#regLifetime#] days."."\n"."\nRegards,"."\n\*[#senderName#]|");


// Писмо до потребителя за смяна на паролата
 # DEFINE('USERREG_RESET_PASS_EMAIL', "\nDear [#names#],"."\n"."\nWe have received request about reseting your password."."\n"."\nTo setup new password, please use following URL:"."\n"."\n[#url#]"."\n"."\nThe above URL will expired after [#regLifetime#] days."."\n"."\nRegards,"."\n[#senderName#]");


/*****************************************************************************
 *                                                                           *
 * Клас 'plg_Vid' - Вербално id за ред                                       *
 *                                                                           *
 * ef/plg/Vid                                                                *
 *                                                                           *
 *****************************************************************************/

// Максимална дължина на полето "Вербален идентификатор"
 # DEFINE('EF_VID_LEN', 64);


/*****************************************************************************
 *                                                                           *
 * Клас  'type_Date' - Тип за дати                                           *
 *                                                                           *
 * ef/type/Date                                                              *
 *                                                                           *
 *****************************************************************************/

// Формат по подразбиране за датите
 # DEFINE('EF_DATE_FORMAT', 'd-m-YEAR');


// Формат по подразбиране за датата при тесни екрани
 # DEFINE('EF_DATE_NARROW_FORMAT', 'd-m-year');


/*****************************************************************************
 *                                                                           *
 * Клас  'type_Datetime' - Тип за време                                      *
 *                                                                           *
 * ef/type/Datetime                                                          *
 *                                                                           *
 *****************************************************************************/

// Формат по подразбиране за времевата част
 # DEFINE('EF_DATETIME_TIME_PART', ' H:i');


/*****************************************************************************
 *                                                                           *
 * Клас 'type_Double' - Тип за рационални числа                              *
 *                                                                           *
 * ef/type/Double                                                            *
 *                                                                           *
 *****************************************************************************/

// Колко цифри след запетаята да показваме по подразбиране?
 # DEFINE('EF_NUMBER_DECIMALS', 4);


// Кой символ за десетична точка да използваме?
 # DEFINE('EF_NUMBER_DEC_POINT', ',');


// Кой символ да използваме за разделител на хилядите?
 # DEFINE('EF_NUMBER_THOUSANDS_SEP', ' ');


/*****************************************************************************
 *                                                                           *
 * Клас  'type_Int' - Тип за цели числа                                      *
 *                                                                           *
 * ef/type/Int                                                               *
 *                                                                           *
 *****************************************************************************/

// Кой символ да използваме за разделител на хилядите?
 # DEFINE('EF_NUMBER_THOUSANDS_SEP', ' ');


/*****************************************************************************
 *                                                                           *
 * Клас  'type_Key' - Ключ към ред от MVC модел                              *
 *                                                                           *
 * ef/type/Key                                                               *
 *                                                                           *
 *****************************************************************************/

// @todo Чака за документация...
 # DEFINE('TYPE_KEY_MAX_SUGGESTIONS', 1000);


/*****************************************************************************
 *                                                                           *
 * Клас  'type_Password' - Тип за парола                                     *
 *                                                                           *
 * ef/type/Password                                                          *
 *                                                                           *
 *****************************************************************************/

// @todo Чака за документация...
 # DEFINE('EF_PASS_NO_CHANGE', 'no_change');


/*****************************************************************************
 *                                                                           *
 * Клас  'type_Percent' - Тип за проценти                                    *
 *                                                                           *
 * ef/type/Percent                                                           *
 *                                                                           *
 *****************************************************************************/

// @todo Чака за документация...
 # DEFINE('EF_PERCENT_DECIMALS', 2);


/*****************************************************************************
 *                                                                           *
 * Клас  'type_Richtext' - Тип за форматиран (като BBCode) текст             *
 *                                                                           *
 * ef/type/Richtext                                                          *
 *                                                                           *
 *****************************************************************************/

// Тип на записите в кеша
 # DEFINE('RICHTEXT_CACHE_TYPE', 'RichText');




/*****************************************************************************

 *                                                                           *

 * Конфигурация на BGERP                                                     *

 *                                                                           *

 *****************************************************************************/ 


/*****************************************************************************
 *                                                                           *
 * Мениджира периодите в счетоводната система                                *
 *                                                                           *
 * bgerp/acc/Periods                                                         *
 *                                                                           *
 *****************************************************************************/

// Задаване начало и край на първия регистриран период
 # DEFINE('BGERP_FIRST_PERIOD_START', acc_Periods::getFirstDayOfCurrentMonth());


// Край на първия период в счетоводната система
 # DEFINE('BGERP_FIRST_PERIOD_END', acc_Periods::getLastDayOfCurrentMonth());


/*****************************************************************************
 *                                                                           *
 * Добавя бланка в началото на документите, които се изпращат или принтират  *
 *                                                                           *
 * bgerp/bgerp/plg/Blank                                                     *
 *                                                                           *
 *****************************************************************************/

// @todo Чака за документация...
 # DEFINE('BGERP_COMPANY_LOGO', 'bgerp/img/companyLogo.png');


// @todo Чака за документация...
 # DEFINE('BGERP_COMPANY_LOGO_BG', 'bgerp/img/companyLogoBg.png');


/*****************************************************************************
 *                                                                           *
 * Шаблон за писма за масово разпращане                                      *
 *                                                                           *
 * bgerp/blast/Emails                                                        *
 *                                                                           *
 *****************************************************************************/

// Имейл-а по подразбиране
 # DEFINE('BGERP_DEFAULT_EMAIL_FROM', );


// Шаблона, който ще се замества с mid
 # DEFINE('BGERP_EMAILS_MID', '[#mid#]');


// Текст за отписване от информационните съобщение
 # DEFINE('BGERP_BLAST_UNSUBSCRIBE', 'Искате ли да премахнете имейл-а си от листата за получаване на информационни съобщения.');


// Текст, който се показва, ако не може да се намери имейл адреса в системата
 # DEFINE('BGERP_BLAST_NO_MAIL', 'Не може да се намери имейл адреса Ви.');


// Teкст, който се показва когато премахнем имейл-а от блокираните
 # DEFINE('BGERP_BLAST_SUCCESS_ADD', 'Имейлът Ви е добавен в списъка за информационни съобщения. Искате ли да го премахнете.');


// Текст, който се показва когато добавим имейл-а в списъка на блокираните имейли
 # DEFINE('BGERP_BLAST_SUCCESS_REMOVED', 'Имейлът Ви е премахнат от списъка за информационни съобщения. Искате ли да добавите имейл-а си в листата.');


/*****************************************************************************
 *                                                                           *
 * Клас 'cams_Records' -                                                     *
 *                                                                           *
 * bgerp/cams/Records                                                        *
 *                                                                           *
 *****************************************************************************/

// Път до директория, където ще се съхраняват записите от камерите
 # DEFINE('CAMS_VIDEOS_PATH', EF_UPLOADS_PATH."/cams/videos");


// Път до директория, където ще се записват jpeg превютата
 # DEFINE('CAMS_IMAGES_PATH', EF_UPLOADS_PATH."/cams/images");


// Директория за flv файловете
 # DEFINE('SBF_CAMS_FLV_DIR', "_cams/flv");


// Път до директория, където ще се записват flv файловете
 # DEFINE('SBF_CAMS_FLV_PATH', EF_SBF_PATH.'/'.SBF_CAMS_FLV_DIR);


// Колко да е продължителността на един клип в секунди
 # DEFINE('CAMS_CLIP_DURATION', 5*60);


// Колко е продължителността на конвертирането на един клип в секунди
 # DEFINE('CAMS_CLIP_TO_FLV_DURATION', round(cams_CLIP_DURATION/30));


// Колко клипа да показва на страница при широк екран
 # DEFINE('CAMS_CLIPS_PER_WIDE_PAGE', 144);


// Колко клипа да показва на страница при тесен екран
 # DEFINE('CAMS_CLIPS_PER_NARROW_PAGE', 12);


// Колко клипа да показва на ред при широк екран
 # DEFINE('CAMS_CLIPS_PER_WIDE_ROW', 6);


// Колко клипа да показва на ред при тесен екран
 # DEFINE('CAMS_CLIPS_PER_NARROW_ROW', 1);


// Колко да е минималното дисково пространство
 # DEFINE('CAMS_MIN_DISK_SPACE', 100*1024*1024*1024);


/*****************************************************************************
 *                                                                           *
 * Фирми                                                                     *
 *                                                                           *
 * bgerp/crm/Companies                                                       *
 *                                                                           *
 *****************************************************************************/

// Константи за инициализиране на таблицата с контактите
 # DEFINE('BGERP_OWN_COMPANY_ID', '1');


// Име на собствената компания (тази за която ще работи bgERP)
 # DEFINE('BGERP_OWN_COMPANY_NAME', 'Моята Фирма ООД');


// Държавата на собствената компания (тази за която ще работи bgERP)
 # DEFINE('BGERP_OWN_COMPANY_COUNTRY', 'Bulgaria');


/*****************************************************************************
 *                                                                           *
 * Клас 'currency_CurrencyRates' -                                           *
 *                                                                           *
 * bgerp/currency/CurrencyRates                                              *
 *                                                                           *
 *****************************************************************************/

// Задаване на основна валута
 # DEFINE('BGERP_BASE_CURRENCY', 'BGN');


/*****************************************************************************
 *                                                                           *
 * Генериране на PDF файлове от HTML файл чрез web kit                       *
 *                                                                           *
 * bgerp/doc/PdfCreator                                                      *
 *                                                                           *
 *****************************************************************************/

// Кофата по подразбиране за генерирани pdf' и
 # DEFINE('BGERP_PDF_BUCKET', 'pdf');


// Кой пакет да използваме за генериране на PDF от HTML ?
 # DEFINE('BGERP_PDF_GENERATOR', 'dompdf');


/*****************************************************************************
 *                                                                           *
 * Email адреси                                                              *
 *                                                                           *
 * bgerp/email/Inboxes                                                       *
 *                                                                           *
 *****************************************************************************/

// Константи за домейн и пощенска кутия по подразбиране - изисква се да бъдат дефинирани
 # DEFINE('BGERP_DEFAULT_EMAIL_DOMAIN', '');


// @todo Чака за документация...
 # DEFINE('BGERP_DEFAULT_EMAIL_FROM', '');


// @todo Чака за документация...
 # DEFINE('BGERP_DEFAULT_EMAIL_USER', '');


// @todo Чака за документация...
 # DEFINE('BGERP_DEFAULT_EMAIL_HOST', '');


// @todo Чака за документация...
 # DEFINE('BGERP_DEFAULT_EMAIL_PASSWORD', '');


/*****************************************************************************
 *                                                                           *
 * Входящи писма                                                             *
 *                                                                           *
 * bgerp/email/Incomings                                                     *
 *                                                                           *
 *****************************************************************************/

// Максимално време за еднократно фетчване на писма
 # DEFINE('IMAP_MAX_FETCHING_TIME', 30);


// Максималната разрешена памет за използване
 # DEFINE('MAX_ALLOWED_MEMORY', '800M');


// Шаблон за име на папките, където отиват писмата от дадена държава и неподлежащи на
// по-адекватно сортиране
 # DEFINE('UNSORTABLE_COUNTRY_EMAILS', 'Unsorted - %s');


/*****************************************************************************
 *                                                                           *
 * Ръчен постинг в документната система                                      *
 *                                                                           *
 * bgerp/email/Outgoings                                                     *
 *                                                                           *
 *****************************************************************************/

// Текста, който ще се показва в хедърната част на постингите
 # DEFINE('BGERP_POSTINGS_HEADER_TEXT', '|*Препратка|');


/*****************************************************************************
 *                                                                           *
 * Клас 'email_Pop3' - Използване на pop3                                    *
 *                                                                           *
 * bgerp/email/Pop3                                                          *
 *                                                                           *
 *****************************************************************************/

// Максималното време за изчакване на буфера
 # DEFINE('POP3_TIMEOUT', 2);


/*****************************************************************************
 *                                                                           *
 *                                                                           *
 *                                                                           *
 * bgerp/tests/config/boot                                                   *
 *                                                                           *
 *****************************************************************************/

// Директорията с конфигурационните файлове
 # DEFINE('EF_CONF_PATH', EF_ROOT_PATH.'/conf');


// По подразбиране от локалния хост се работи в режим DEBUG
 # DEFINE('EF_DEBUG_HOSTS', 'localhost,127.0.0.1');


// Базовото име на директорията за статичните браузърни файлове
 # DEFINE('EF_SBF', 'sbf');


// Името на приложението. Използва се за определяне на други константи.
 # DEFINE('EF_APP_NAME', $_GET['App']);


// Времева зона
 # DEFINE('EF_TIMEZONE', function_exists("date_default_timezone_get");


// Директорията с външни пакети
 # DEFINE('EF_VENDORS_PATH', EF_ROOT_PATH.'/vendors');


// Базова директория, където се намират приложенията
 # DEFINE('EF_APP_BASE_PATH', EF_ROOT_PATH);


// Директорията с приложението
 # DEFINE('EF_APP_PATH', EF_APP_BASE_PATH.'/'.EF_APP_CODE_NAME);


// Базова директория, където се намират под-директориите с временни файлове
 # DEFINE('EF_TEMP_BASE_PATH', EF_ROOT_PATH.'/temp');


// Директорията с временни файлове
 # DEFINE('EF_TEMP_PATH', EF_TEMP_BASE_PATH.'/'.EF_APP_NAME);


// Базова директория, където се намират под-директориите с качените файлове
 # DEFINE('EF_UPLOADS_BASE_PATH', EF_ROOT_PATH.'/uploads');


// Директорията с качените и генерираните файлове
 # DEFINE('EF_UPLOADS_PATH', EF_UPLOADS_BASE_PATH.'/'.EF_APP_NAME);




/*****************************************************************************

 *                                                                           *

 * Конфигурация на VENDORS                                                   *

 *                                                                           *

 *****************************************************************************/ 


/*****************************************************************************
 *                                                                           *
 * Клас 'avatar_Plugin' -                                                    *
 *                                                                           *
 * vendors/avatar/Plugin                                                     *
 *                                                                           *
 *****************************************************************************/

// @todo Чака за документация...
 # DEFINE('AVATAR_DIR', EF_DOWNLOAD_DIR.'/'.'AVATAR');


// @todo Чака за документация...
 # DEFINE('AVATAR_URL', EF_DOWNLOAD_ROOT.'/'.'AVATAR');


/*****************************************************************************
 *                                                                           *
 * Клас 'barcode_Qr' - Генериране на QR изображения                          *
 *                                                                           *
 * vendors/barcode/Qr                                                        *
 *                                                                           *
 *****************************************************************************/

// @todo Чака за документация...
 # DEFINE('BARCODE_SALT', EF_SALT.'_BARCODE');


/*****************************************************************************
 *                                                                           *
 * Клас 'captcha_Type' -                                                     *
 *                                                                           *
 * vendors/captcha/Type                                                      *
 *                                                                           *
 *****************************************************************************/

// Колко минути да е активна информацията в кеша?
 # DEFINE('CAPTCHA_LIFETIME', 10);


// Колко символа да е дълга капчата?
 # DEFINE('CAPTCHA_LENGTH', 4);


// Колко да са високи символите?
 # DEFINE('CAPTCHA_HEIGHT', 28);


// Колко да е широко изображението?
 # DEFINE('CAPTCHA_WIDTH', round(0.70*CAPTCHA_HEIGHT*CAPTCHA_LENGTH));


// С какъв тип да се правят записите в кеша?
 # DEFINE('CAPTCHA_CACHE_TYPE', 'Captcha');


/*****************************************************************************
 *                                                                           *
 * Клас 'chosen_Plugin' - избор на дата                                      *
 *                                                                           *
 * vendors/chosen/Plugin                                                     *
 *                                                                           *
 *****************************************************************************/

// Пътя до външния код на chosen
 # DEFINE('CHOSEN_PATH', 'chosen/0.9.3');


// Минималния брой елементи, за които няма да сработи Chosen
 # DEFINE('EF_MIN_COUNT_LIST_CHOSEN', 16);


/*****************************************************************************
 *                                                                           *
 * Клас 'hclean_HtmlPurifyPlg' - Изчистване на HTML полета                   *
 *                                                                           *
 * vendors/dompdf/Converter                                                  *
 *                                                                           *
 *****************************************************************************/

// @todo Чака за документация...
 # DEFINE('DOMPDF_VER', '3.0');


// Дефинира име на папка в която ще се съхраняват временните данни данните
 # DEFINE('DOMPDF_TEMP_DIR', EF_TEMP_PATH."/dompdf");


// 
 # DEFINE('DOMPDF_DPI', "120");


// 
 # DEFINE('DOMPDF_ENABLE_REMOTE', TRUE);


/*****************************************************************************
 *                                                                           *
 * Клас 'drdata_Emails' -                                                    *
 *                                                                           *
 * vendors/drdata/Emails                                                     *
 *                                                                           *
 *****************************************************************************/

// @todo Чака за документация...
 # DEFINE('SENDER_HOST', "colocation.download.bg");


// @todo Чака за документация...
 # DEFINE('SENDER_EMAIL', "team@extrapack.com");


/*****************************************************************************
 *                                                                           *
 * Клас 'editwatch_Editors' -                                                *
 *                                                                           *
 * vendors/editwatch/Editors                                                 *
 *                                                                           *
 *****************************************************************************/

// Колко секунди да пази записите в таблицата минимално
 # DEFINE('EDITWATCH_REC_LIFETIME', 5*60);


/*****************************************************************************
 *                                                                           *
 * Клас 'core_Expert'                                                        *
 *                                                                           *
 * vendors/expert/Expert                                                     *
 *                                                                           *
 *****************************************************************************/

// Къде да се съхранява състоянието на експертизата?
 # DEFINE('EXPERT_SAVE_STATE_IN_CACHE', TRUE);


// Дефинира колко минути е 'живо' състоянието
 # DEFINE('EXPERT_STATE_LIFETIME', 45);


// Тип на записа в кеша
 # DEFINE('EXPERT_CACHE_TYPE', 'Expert');


/*****************************************************************************
 *                                                                           *
 * Клас 'fancybox_Fancybox'                                                  *
 *                                                                           *
 * vendors/fancybox/Fancybox                                                 *
 *                                                                           *
 *****************************************************************************/

// Път до външния пакет
 # DEFINE('FANCYBOX_PATH', 'fancybox/1.3.4');


/*****************************************************************************
 *                                                                           *
 * Показва стартираните процеси                                              *
 *                                                                           *
 * vendors/fconv/Processes                                                   *
 *                                                                           *
 *****************************************************************************/

// @todo Чака за документация...
 # DEFINE('FCONV_HANDLER_LEN', 8);


/*****************************************************************************
 *                                                                           *
 * Клас 'fileman_Data' - Указател към данните за всеки файл                  *
 *                                                                           *
 * vendors/fileman/Data                                                      *
 *                                                                           *
 *****************************************************************************/

// Пътя до директорията за файловете е общ за всички инсталирани приложения
 # DEFINE('FILEMAN_UPLOADS_PATH', substr(EF_UPLOADS_PATH,0,strrpos(EF_UPLOADS_PATH,'/'));


/*****************************************************************************
 *                                                                           *
 * Клас 'fileman_Download' -                                                 *
 *                                                                           *
 * vendors/fileman/Download                                                  *
 *                                                                           *
 *****************************************************************************/

// @todo Чака за документация...
 # DEFINE('EF_DOWNLOAD_ROOT', '_dl_');


// @todo Чака за документация...
 # DEFINE('EF_DOWNLOAD_DIR', EF_INDEX_PATH.'/'.EF_SBF.'/'.EF_APP_NAME.'/'.EF_DOWNLOAD_ROOT);


// @todo Чака за документация...
 # DEFINE('EF_DOWNLOAD_PREFIX_PTR', '$*****');


/*****************************************************************************
 *                                                                           *
 * Клас 'fileman_Files' -                                                    *
 *                                                                           *
 * vendors/fileman/Files                                                     *
 *                                                                           *
 *****************************************************************************/

// Каква да е дължината на манипулатора на файла?
 # DEFINE('FILEMAN_HANDLER_PTR', '$*****');


/*****************************************************************************
 *                                                                           *
 * Клас 'fileman_SetExtensionPlg'                                            *
 * Проверка и коригиране на разширението на файла                            *
 *                                                                           *
 * vendors/fileman/SetExtensionPlg                                           *
 *                                                                           *
 *****************************************************************************/

// Задава командата за определяне на mime типа
// Константата е дефинирана по подразбиране само в Линукс
 # DEFINE('EF_EXTENSION_FILE_PROGRAM', 'file');


/*****************************************************************************
 *                                                                           *
 * Клас 'flexpaper_Render'                                                   *
 *                                                                           *
 * vendors/flexpaper/Render                                                  *
 *                                                                           *
 *****************************************************************************/

// Път до външния файл
 # DEFINE('FLEXPAPER_PATH', sbf("flexpaper/1.4.5/FlexPaperViewer.swf"));


/*****************************************************************************
 *                                                                           *
 * Генерира необходимият код за плейване на flv файлове                      *
 *                                                                           *
 * vendors/flvplayer/Embedder                                                *
 *                                                                           *
 *****************************************************************************/

// @todo Чака за документация...
 # DEFINE('FLVPLAYER_PATH', sbf("flvplayer/1.6.0/player_flv_maxi.swf"));


/*****************************************************************************
 *                                                                           *
 * Клас 'hclean_Purifier' - Пречистване на HTML                              *
 *                                                                           *
 * vendors/hclean/Purifier                                                   *
 *                                                                           *
 *****************************************************************************/

// Папка за съхранение на временните файлове
 # DEFINE('PURIFIER_TEMP_PATH', EF_TEMP_PATH.'/purifer');


/*****************************************************************************
 *                                                                           *
 * Клас 'jqdatepick_Plugin' - избор на дата                                  *
 *                                                                           *
 * vendors/jqdatepick/Plugin                                                 *
 *                                                                           *
 *****************************************************************************/

// @todo Чака за документация...
 # DEFINE('JQDATEPICKER_VERSION', 'v4.0.6');


/*****************************************************************************
 *                                                                           *
 * Клас 'jsgauge_Gauge'                                                      *
 *                                                                           *
 * vendors/jsgauge/Gauge                                                     *
 *                                                                           *
 *****************************************************************************/

// Път до външния файл
 # DEFINE('GAUGE_PATH', 'jsgauge/0.4.1');


/*****************************************************************************
 *                                                                           *
 * Клас 'keyboard_Plugin' -                                                  *
 *                                                                           *
 * vendors/keyboard/Plugin                                                   *
 *                                                                           *
 *****************************************************************************/

// @todo Чака за документация...
 # DEFINE('VKI_VERSION', '1.28');


/*****************************************************************************
 *                                                                           *
 * SMS-и през Мобио                                                          *
 *                                                                           *
 * vendors/mobio/SmsPlugin                                                   *
 *                                                                           *
 *****************************************************************************/

// Урл за изпращане на СМС-и през Мобио
 # DEFINE('MOBIO_URL', '');


/*****************************************************************************
 *                                                                           *
 * Хранилището за перманентни данни.                                         *
 *                                                                           *
 * vendors/permanent/Data                                                    *
 *                                                                           *
 *****************************************************************************/

// Какъв е максималния размер на некомпресираните данни в байтове
 # DEFINE('DATA_MAX_UNCOMPRESS', 10000);


/*****************************************************************************
 *                                                                           *
 * Клас 'php_Formater' - Форматер за приложения на EF                        *
 *                                                                           *
 * vendors/php/Formater                                                      *
 *                                                                           *
 *****************************************************************************/

// Обща директория на bgerp, vendors, ef. Използва се за едновременно форматиране на трите пакета.
 # DEFINE('EF_ALL_PATH', EF_ROOT_PATH.'/all');


// 
 # DEFINE('TITLE', '
/*****************************************************************************
 *                                                                           *
 *      Примерен конфигурационен файл за приложение в Experta Framework      *
 *                                                                           *
 *      След като се попълнят стойностите на константите, този файл          *
 *      трябва да бъде записан в [conf] директорията под име:                *
 *      [име на приложението].cfg.php                                        *
 *                                                                           *
 *****************************************************************************/ ');


// 
 # DEFINE('CAPTION', '
/*****************************************************************************
 *                                                                           *
 * Конфигурация на всички пакети                                             *
 *                                                                           *
 *****************************************************************************/ ');


// 
 # DEFINE('CAPTIONNULL', '
/*****************************************************************************
 *                                                                           *
 * Задължително въведете стойности на следните константи                     *
 *                                                                           *
 *****************************************************************************/ ');


// @todo Чака за документация...
 # DEFINE('DBCONF', '

/*****************************************************************************
 *                                                                           *
 * Параметри за връзка с базата данни                                        *
 *                                                                           *
 *****************************************************************************/ 

// Име на базата данни. По подразбиране е същото, като името на приложението
   DEFINE(\'EF_DB_NAME\', EF_APP_NAME);

// Потребителско име. По подразбиране е същото, като името на приложението
   DEFINE(\'EF_DB_USER\', EF_APP_NAME);

// По-долу трябва да се постави реалната парола за връзка
// с базата данни на потребителят дефиниран в предходния ред
   DEFINE(\'EF_DB_PASS\', \'bgerp\'); 

// Сървъра за на базата данни
   DEFINE(\'EF_DB_HOST\', \'localhost\');
 
// Кодировка на забата данни
   DEFINE(\'EF_DB_CHARSET\', \'utf8\');


/*****************************************************************************
 *                                                                           *
 * Пътища до някои важни части от системата                                  *
 *                                                                           *
 *****************************************************************************/ 

// Път по подразбиране за пакетите от \'vendors\'
 # DEFINE(\'EF_VENDORS_PATH\', EF_ROOT_PATH . \'/vendors\');

// Път по подразбиране за пакетите от \'private\'
 # DEFINE(\'EF_PRIVATE_PATH\', EF_ROOT_PATH . \'/private\');

// Базова директория, където се намират по-директориите за
// временните файлове. По подразбиране е в
// EF_ROOT_PATH/temp
 # DEFINE( \'EF_TEMP_BASE_PATH\', \'PATH_TO_FOLDER\');

// Базова директория, където се намират по-директориите за
// потребителски файлове. По подразбиране е в
// EF_ROOT_PATH/uploads
 # DEFINE( \'EF_UPLOADS_BASE_PATH\', \'PATH_TO_FOLDER\');

// Твърдо, фиксирано име на мениджъра с контролерните функции. 
// Ако се укаже, цялотоможе да има само един такъв 
// мениджър функции. Това е удобство за специфични приложения, 
// при които не е добре името на мениджъра да се вижда в URL-то
 # DEFINE(\'EF_CTR_NAME\', \'FIXED_CONTROLER\');

// Твърдо, фиксирано име на екшън (контролерна функция). 
// Ако се укаже, от URL-то се изпускат екшъните.
 # DEFINE(\'EF_ACT_NAME\', \'FIXED_CONTROLER\');

// Базова директория, където се намират приложенията
 # DEFINE(\'EF_APP_BASE_PATH\', \'PATH_TO_FOLDER\');

// Директорията с конфигурационните файлове
 # DEFINE(\'EF_CONF_PATH\', EF_ROOT_PATH . \'/conf\');
');


// @todo Чака за документация...
 # DEFINE('CAPTIONEF', '
/*****************************************************************************
 *                                                                           *
 * Конфигурация на EF                                                        *
 *                                                                           *
 *****************************************************************************/ ');


// @todo Чака за документация...
 # DEFINE('CAPTIONBGERP', '
/*****************************************************************************
 *                                                                           *
 * Конфигурация на BGERP                                                     *
 *                                                                           *
 *****************************************************************************/ ');


// @todo Чака за документация...
 # DEFINE('CAPTIONVENDORS', '
/*****************************************************************************
 *                                                                           *
 * Конфигурация на VENDORS                                                   *
 *                                                                           *
 *****************************************************************************/ ');


/*****************************************************************************
 *                                                                           *
 * Клас 'php_Formater' - Форматер за приложения на EF                        *
 *                                                                           *
 * vendors/php/Test                                                          *
 *                                                                           *
 *****************************************************************************/

// Обща директория на bgerp, vendors, ef. Използва се за едновременно форматиране на трите пакета.
 # DEFINE('EF_ALL_PATH', EF_ROOT_PATH.'/all');


/*****************************************************************************
 *                                                                           *
 * Клас от EF, който агрегира PHP Mailer Lite                                *
 *                                                                           *
 * vendors/phpmailer/Instance                                                *
 *                                                                           *
 *****************************************************************************/

// Подразбиращата се кодировка на съобщенията
 # DEFINE('PML_CHARSET', 'utf-8');


// Ник-а на изпращача по подразбиране
 # DEFINE('PML_DEF_NICK', 'support');


// Адреса във 'From' хедър-а на съобщението
 # DEFINE('PML_FROM_EMAIL', PML_DEF_NICK.'@'.$_SERVER['SERVER_NAME']);


// Името във 'From' хедър-а на съобщението
 # DEFINE('PML_FROM_NAME', EF_APP_TITLE.' '.mb_convert_case(PML_DEF_NICK,MB_CASE_TITLE,PML_CHARSET));


// Адреса на изпращача (Return-Path) на съобщението
 # DEFINE('PML_SENDER', PML_FROM_EMAIL);


// Какъв да е метода за изпращане на писма?
// ("mail", "sendmail", or "smtp")
 # DEFINE('PML_MAILER', 'sendmail');


// Къде се намира Sendmail?
 # DEFINE('SENDMAIL_PATH', '/usr/sbin/sendmail');


// Дефинираме пътя до кода на PHP_Mailer
 # DEFINE('PML_CLASS', '5.2/class.phpmailer.php');


// Да изпраща ли по единично писмата от адресите в 'To:'
 # DEFINE('PML_SINGLE_TO', FALSE);


/*****************************************************************************
 *                                                                           *
 * Клас  'physics_HumidityType' - Тип за температура                         *
 *                                                                           *
 * vendors/physics/HumidityType                                              *
 *                                                                           *
 *****************************************************************************/

// Колко цифри след запетаята да се показват
 # DEFINE('EF_HUMIDITYTYPE_DECIMALS', 0);


/*****************************************************************************
 *                                                                           *
 * Клас  'physics_PressureType' - Тип за температура                         *
 *                                                                           *
 * vendors/physics/PressureType                                              *
 *                                                                           *
 *****************************************************************************/

// Колко цифри след запетаята да се показват
 # DEFINE('EF_PRESSURETYPE_DECIMALS', 1);


// Мерната единица по подразбиране
 # DEFINE('EF_DEFAULT_UNIT_PRESSURE', 'bar');


/*****************************************************************************
 *                                                                           *
 * Клас  'physics_TemperatureType' - Тип за температура                      *
 *                                                                           *
 * vendors/physics/TemperatureType                                           *
 *                                                                           *
 *****************************************************************************/

// Колко цифри след запетаята да се показват
 # DEFINE('EF_TEMPERATURETYPE_DECIMALS', 2);


// Мерната единица по подразбиране
 # DEFINE('EF_DEFAULT_UNIT', '°C');


/*****************************************************************************
 *                                                                           *
 * SMS-и през Pro-SMS                                                        *
 *                                                                           *
 * vendors/prosms/Plugin                                                     *
 *                                                                           *
 *****************************************************************************/

// @todo Чака за документация...
 # DEFINE('PROSMS_URL', '');


// @todo Чака за документация...
 # DEFINE('PROSMS_USER', '');


// @todo Чака за документация...
 # DEFINE('PROSMS_PASS', '');


/*****************************************************************************
 *                                                                           *
 * Клас 'recently_Values'                                                    *
 *                                                                           *
 * vendors/recently/Values                                                   *
 *                                                                           *
 *****************************************************************************/

// Максимален брой за предложенията за последно използвани стойности на поле
 # DEFINE('RECENTLY_MAX_SUGGESTION', 20);


// Максимален брой дни за запазване на стойност след нейната последна употреба
 # DEFINE('RECENTLY_MAX_KEEPING_DAYS', 60);


/*****************************************************************************
 *                                                                           *
 * Клас 'thumbnail_Thumbnail' -                                              *
 *                                                                           *
 * vendors/thumbnail/Thumbnail                                               *
 *                                                                           *
 *****************************************************************************/

// @todo Чака за документация...
 # DEFINE('THUMBNAIL_FOLDER', EF_DOWNLOAD_DIR.'/'.'TB');


// @todo Чака за документация...
 # DEFINE('THUMBNAIL_URL', EF_DOWNLOAD_ROOT.'/'.'TB');


/*****************************************************************************
 *                                                                           *
 * Генериране на PDF файлове от HTML файл чрез web kit                       *
 *                                                                           *
 * vendors/webkittopdf/Converter                                             *
 *                                                                           *
 *****************************************************************************/

// Дефинира име на папка в която ще се съхраняват временните данни данните
 # DEFINE('WEBKIT_TO_PDF_TEMP_DIR', EF_TEMP_PATH."/webkittopdf");


// Изпълнимия файл на програмата
 # DEFINE('WEBKIT_TO_PDF_BIN', "/usr/bin/wkhtmltopdf");


// Оказва дали да се изплни помпщната програма (xvfb-run)
 # DEFINE('WEBKIT_TO_PDF_XVFB_RUN', TRUE);


// xvfb-run - Ширина на екрана
 # DEFINE('WEBKIT_TO_PDF_SCREEN_WIDTH', "640");


// xvfb-run - Височина на екрана
 # DEFINE('WEBKIT_TO_PDF_SCREEN_HEIGHT', "480");


// xvfb-run - Дълбочина на цвета
 # DEFINE('WEBKIT_TO_PDF_SCREEN_BIT', "16");


/*****************************************************************************
 *                                                                           *
 * XMPP съобщения                                                            *
 *                                                                           *
 * vendors/xmpphp/Sender                                                     *
 *                                                                           *
 *****************************************************************************/

// @todo Чака за документация...
 # DEFINE('XMPPHP_VERSION', '0.1rc2-r77');


// 
 # DEFINE('XMPPHP_SERVER', 'talk.google.com');


// 
 # DEFINE('XMPPHP_PORT', '5222');


// 
 # DEFINE('XMPPHP_USER', );


// 
 # DEFINE('XMPPHP_PASSWORD', );


// 
 # DEFINE('XMPPHP_DOMAIN', 'gmail.com');


