
/*****************************************************************************
 *                                                                           *
 *      Примерен конфигурационен файл за приложение в Experta Framework      *
 *                                                                           *
 *      След като се попълнят стойностите на константите, този файл          *
 *      трябва да бъде записан в [conf] директорията под име:                *
 *      [име на приложението].cfg.php                                        *
 *                                                                           *
 *****************************************************************************/




/*****************************************************************************
 *                                                                           *
 * Параметри за връзка с базата данни                                        *
 *                                                                           *
 *****************************************************************************/ 

// Име на базата данни. По подразбиране е същото, като името на приложението
   DEFINE('EF_DB_NAME', EF_APP_NAME);

// Потребителско име. По подразбиране е същото, като името на приложението
   DEFINE('EF_DB_USER', EF_APP_NAME);

// По-долу трябва да се постави реалната парола за връзка
// с базата данни на потребителят дефиниран в предходния ред
   DEFINE('EF_DB_PASS', 'bgerp'); 

// Сървъра за на базата данни
   DEFINE('EF_DB_HOST', 'localhost');
 
// Кодировка на забата данни
   DEFINE('EF_DB_CHARSET', 'utf8');


/*****************************************************************************
 *                                                                           *
 * Пътища до някои важни части от системата                                  *
 *                                                                           *
 *****************************************************************************/ 

// Път по подразбиране за пакетите от 'vendors'
 # DEFINE('EF_VENDORS_PATH', EF_ROOT_PATH . '/vendors');

// Път по подразбиране за пакетите от 'private'
 # DEFINE('EF_PRIVATE_PATH', EF_ROOT_PATH . '/private');

// Базова директория, където се намират по-директориите за
// временните файлове. По подразбиране е в
// EF_ROOT_PATH/temp
 # DEFINE( 'EF_TEMP_BASE_PATH', 'PATH_TO_FOLDER');

// Базова директория, където се намират по-директориите за
// потребителски файлове. По подразбиране е в
// EF_ROOT_PATH/uploads
 # DEFINE( 'EF_UPLOADS_BASE_PATH', 'PATH_TO_FOLDER');

// Твърдо, фиксирано име на мениджъра с контролерните функции. 
// Ако се укаже, цялото проложение може да има само един такъв 
// мениджър функции. Това е удобство за специфични приложения, 
// при които не е добре името на мениджъра да се вижда в URL-то
 # DEFINE('EF_CTR_NAME', 'FIXED_CONTROLER');

// Твърдо, фиксирано име на екшън (контролерна функция). 
// Ако се укаже, от URL-то се изпускат екшъните.
 # DEFINE('EF_ACT_NAME', 'FIXED_CONTROLER');

// Базова директория, където се намират приложенията
 # DEFINE('EF_APP_BASE_PATH', 'PATH_TO_FOLDER');

// Директорията с конфигурационните файлове
 # DEFINE('EF_CONF_PATH', EF_ROOT_PATH . '/conf');


/*****************************************************************************
 *                                                                           *
 *   Настройки на е-майл системата за получаване на писма                    *
 *                                                                           *
 *****************************************************************************/
// Imap/Pop3 сървър
 # DEFINE('BGERP_DEFAULT_EMAIL_HOST', 'localhost');

// Потребител
# DEFINE('BGERP_DEFAULT_EMAIL_USER', 'catchall@bgerp.com');

// Парола
 # DEFINE('BGERP_DEFAULT_EMAIL_PASSWORD', '*****');

// Дефинира разрешените домейни за използване на услугата
 # DEFINE('EF_ALLOWED_DOMAINS', 0);



/*****************************************************************************
 *                                                                           *
 * Конфигурация на EF                                                        *
 *                                                                           *
 *****************************************************************************/ 


/*****************************************************************************
 *                                                                           *
 * Клас 'core_Cache'                                                         *
 * Кеширане на обекти, променливи или масиви за определено време             *
 *                                                                           *
 * ef/core/Cache                                                             *
 *                                                                           *
 *****************************************************************************/

// Максимален размер за полето на типа
 # DEFINE('EF_CACHE_TYPE_SIZE', 16);


// Максимален размер за полето на манипулатора
 # DEFINE('EF_CACHE_HANDLER_SIZE', 32);


// Колко голям да бъде максималния обект, който се съхранява
// в кеша не-компресиран?
 # DEFINE('EF_CACHE_MAX_UNCOMPRESS', 10000);


/*****************************************************************************
 *                                                                           *
 * Клас 'core_Crypt' - Функции за двупосочно криптиране със споделен ключ    *
 *                                                                           *
 * ef/core/Crypt                                                             *
 *                                                                           *
 *****************************************************************************/

// Ключа с който ще се крипира, ако не бъде зададен експлицитно
 # DEFINE('EF_CRYPT_CODE', EF_SALT.'EF_CRYPT_CODE');


/*****************************************************************************
 *                                                                           *
 * Клас 'core_Db' - Манипулиране на MySQL-ски бази данни                     *
 *                                                                           *
 * ef/core/Db                                                                *
 *                                                                           *
 *****************************************************************************/

// Задава кодировката на базата данни по подразбиране
 # DEFINE('EF_DB_CHARSET', 'utf8');


/*****************************************************************************
 *                                                                           *
 * Клас 'core_Lg' - Мениджър за многоезичен превод на интерфейса             *
 *                                                                           *
 * ef/core/Lg                                                                *
 *                                                                           *
 *****************************************************************************/

// Езикът по подразбиране е български
 # DEFINE('EF_DEFAULT_LANGUAGE', 'bg');


/*****************************************************************************
 *                                                                           *
 * Клас 'core_Mode' ['Mode'] - Вътрешно състояние по време на хита и сесията *
 *                                                                           *
 * ef/core/Mode                                                              *
 *                                                                           *
 *****************************************************************************/

// @todo Чака за документация...
 # DEFINE('EF_MODE_SESSION_VAR', 'pMode');


/*****************************************************************************
 *                                                                           *
 * Клас 'core_Mvc' - Манипулаци на модела (таблица в db)                     *
 *                                                                           *
 * ef/core/Mvc                                                               *
 *                                                                           *
 *****************************************************************************/

// По подразбиране, няма префикс преди името на таблицата
 # DEFINE('EF_DB_TABLE_PREFIX', '');


/*****************************************************************************
 *                                                                           *
 * Клас 'core_Roles' - Мениджър за ролите на потребителите                   *
 *                                                                           *
 * ef/core/Roles                                                             *
 *                                                                           *
 *****************************************************************************/

// С каква роля да получават новите потребители по подразбиране?
 # DEFINE('EF_ROLES_DEFAULT', 'user');


/*****************************************************************************
 *                                                                           *
 * Клас 'core_Users' - Мениджър за потребителите на системата                *
 *                                                                           *
 * ef/core/Users                                                             *
 *                                                                           *
 *****************************************************************************/

// Колко дни потребител може да не активира първоначално достъпа си
// преди да бъде изтрит
 # DEFINE('USERS_DRAFT_MAX_DAYS', 3);


// Какво е минималното време в секунди, между хитовете от
// два различни IP адреса, за да не бъде блокирана сметката
 # DEFINE('EF_USERS_MIN_TIME_WITHOUT_BLOCKING', 120);


// Дали да се използва имейл адресът, вместо ник
 # DEFINE('EF_USSERS_EMAIL_AS_NICK', FALSE);


// 'Подправка' за кодиране на паролите
 # DEFINE('EF_USERS_PASS_SALT', EF_SALT);


// Дефинира, ако не е, колко време записът
// за текущия потребител да е валиден в сесията
 # DEFINE('EF_USERS_CURRENT_REC_LIFETIME', 20);


// Как да се казва променливата на cookieто
 # DEFINE('EF_USERS_COOKIE', 'uid');


/*****************************************************************************
 *                                                                           *
 *                                                                           *
 *                                                                           *
 * ef/core/boot                                                              *
 *                                                                           *
 *****************************************************************************/

// Времева зона
 # DEFINE('EF_TIMEZONE', );


/*****************************************************************************
 *                                                                           *
 * Клас 'plg_ExportCsv'                                                      *
 * Дава възможност за експорт към CSV на избрани полета от модела            *
 * които имат атрибут'export=Csv'                                            *
 *                                                                           *
 * ef/plg/ExportCsv                                                          *
 *                                                                           *
 *****************************************************************************/

// @todo Чака за документация...
 # DEFINE('EF_MAX_EXPORT_CNT', 1);


/*****************************************************************************
 *                                                                           *
 * Клас 'plg_UserReg' - Самостоятелна регистрация на потребителите           *
 *                                                                           *
 * ef/plg/UserReg                                                            *
 *                                                                           *
 *****************************************************************************/

// Съобщение, което получава потребителя след регистрация
 # DEFINE('USERREG_THANK_FOR_REG_MSG', "Благодарим ви за регистрациятa|*!"."<br><br>|На посочения от вас адрес беше изпратено писмо със заглавие \"Access activation\"|*."."<br>|В него се съдържа линк, чрез който трябва да зададете вашата парола за|* ".EF_APP_TITLE." ."."<br><br>|Поздрави от екипа!");


// Каква е минималната дължина за паролата?
 # DEFINE('USERREG_MIN_PASS', 5);


// Типа на записите в кеша
 # DEFINE('USERREG_CACHE_TYPE', 'UserReg');


// Съобщение, което получава потребителя след заявка за смяна на паролата
 # DEFINE('USERREG_THANK_FOR_RESET_PASS_MSG', "Заявката за смяната на паролата е приета|*!"."<br><br>|На посочения от вас адрес беше изпратено писмо със заглавие \"Reset Your password\"|*."."<br>|В него се съдържа линк, чрез който трябва да зададете вашата нова парола за|* ".EF_APP_TITLE." ."."<br><br>|Поздрави от екипа!");


// Писмо до потребителя за активация
 # DEFINE('USERREG_ACTIVATION_ЕMAIL', "|\nDear |*[#names#]|,"."\n"."\nThank you for your registration."."\n"."\nTo setup your password, please use following URL:"."\n"."\n|*[#url#]|"."\n"."\nThe above URL will expired after [#regLifetime#] days."."\n"."\nRegards,"."\n\*[#senderName#]|");


// Писмо до потребителя за смяна на паролата
 # DEFINE('USERREG_RESET_PASS_ЕMAIL', "\nDear [#names#],"."\n"."\nWe have received request about reseting your password."."\n"."\nTo setup new password, please use following URL:"."\n"."\n[#url#]"."\n"."\nThe above URL will expired after [#regLifetime#] days."."\n"."\nRegards,"."\n[#senderName#]");


/*****************************************************************************
 *                                                                           *
 * Клас 'plg_Vid' - Вербално id за ред                                       *
 *                                                                           *
 * ef/plg/Vid                                                                *
 *                                                                           *
 *****************************************************************************/

// Максимална дължина на полето "Вербален идентификатор"
 # DEFINE('EF_VID_LEN', 64);


/*****************************************************************************
 *                                                                           *
 * Клас  'type_Date' - Тип за дати                                           *
 *                                                                           *
 * ef/type/Date                                                              *
 *                                                                           *
 *****************************************************************************/

// Формат по подразбиране за датата при тесни екрани
 # DEFINE('EF_DATE_NARROW_FORMAT', 'd-m-year');


// Формат по подразбиране за датите
 # DEFINE('EF_DATE_FORMAT', 'd-m-YEAR');


/*****************************************************************************
 *                                                                           *
 * Клас  'type_Datetime' - Тип за време                                      *
 *                                                                           *
 * ef/type/Datetime                                                          *
 *                                                                           *
 *****************************************************************************/

// Формат по подразбиране за времевата част
 # DEFINE('EF_DATETIME_TIME_PART', ' H:i');


/*****************************************************************************
 *                                                                           *
 * Клас 'type_Double' - Тип за рационални числа                              *
 *                                                                           *
 * ef/type/Double                                                            *
 *                                                                           *
 *****************************************************************************/

// Колко цифри след запетаята да показваме по подразбиране?
 # DEFINE('EF_NUMBER_DECIMALS', 4);


// Кой символ за десетична точка да използваме?
 # DEFINE('EF_NUMBER_DEC_POINT', ',');


// Кой символ да използваме за разделител на хилядите?
 # DEFINE('EF_NUMBER_THOUSANDS_SEP', ' ');


/*****************************************************************************
 *                                                                           *
 * Клас  'type_Int' - Тип за цели числа                                      *
 *                                                                           *
 * ef/type/Int                                                               *
 *                                                                           *
 *****************************************************************************/

// Кой символ да използваме за разделител на хилядите?
 # DEFINE('EF_NUMBER_THOUSANDS_SEP', ' ');


/*****************************************************************************
 *                                                                           *
 * Клас  'type_Key' - Ключ към ред от MVC модел                              *
 *                                                                           *
 * ef/type/Key                                                               *
 *                                                                           *
 *****************************************************************************/

// @todo Чака за документация...
 # DEFINE('TYPE_KEY_MAX_SUGGESTIONS', 1000);


/*****************************************************************************
 *                                                                           *
 * Клас  'type_Password' - Тип за парола                                     *
 *                                                                           *
 * ef/type/Password                                                          *
 *                                                                           *
 *****************************************************************************/

// @todo Чака за документация...
 # DEFINE('EF_PASS_NO_CHANGE', 'no_change');


/*****************************************************************************
 *                                                                           *
 * Клас  'type_Percent' - Тип за проценти                                    *
 *                                                                           *
 * ef/type/Percent                                                           *
 *                                                                           *
 *****************************************************************************/

// @todo Чака за документация...
 # DEFINE('EF_PERCENT_DECIMALS', 2);


/*****************************************************************************
 *                                                                           *
 * Клас  'type_Richtext' - Тип за форматиран (като BBCode) текст             *
 *                                                                           *
 * ef/type/Richtext                                                          *
 *                                                                           *
 *****************************************************************************/

// Тип на записите в кеша
 # DEFINE('RICHTEXT_CACHE_TYPE', 'RichText');



/*****************************************************************************
 *                                                                           *
 * Конфигурация на BGERP                                                     *
 *                                                                           *
 *****************************************************************************/ 


/*****************************************************************************
 *                                                                           *
 * Менаджира периодите в счетоводната система                                *
 *                                                                           *
 * bgerp/acc/Periods                                                         *
 *                                                                           *
 *****************************************************************************/

// Задаване начало и край на първия регистриран период
 # DEFINE('BGERP_FIRST_PERIOD_START', acc_Periods::getFirstDayOfCurrentMonth();


// Край на първия период в счетоводната система
 # DEFINE('BGERP_FIRST_PERIOD_END', acc_Periods::getLastDayOfCurrentMonth();


/*****************************************************************************
 *                                                                           *
 * Шаблон за писма за масово разпращане                                      *
 *                                                                           *
 * bgerp/blast/Emails                                                        *
 *                                                                           *
 *****************************************************************************/

// Имейла по подразбиране
 # DEFINE('BGERP_DEFAULT_EMAIL_FROM', 'team@bgerp.com');


// Шаблона, който ще се замества с mid
 # DEFINE('BGERP_EMAILS_MID', '[#mid#]');


// Текст, който се показва, ако не може да се намери имейл адреса в системата
 # DEFINE('BGERP_BLAST_NO_MAIL', 'Не може да се намери имейл адреса Ви.');


// Текст за отписване от информационните съобщение
 # DEFINE('BGERP_BLAST_UNSUBSCRIBE', 'Искате ли да премахнете имейла си от листата за получаване на информацинни съобщения.');


// Teкст, който се показва когато премахнем имейла от блокираните
 # DEFINE('BGERP_BLAST_SUCCESS_ADD', 'Имейлът Ви е добавен в списъка за информационни съобщения. Иската ли да го премахнете.');


// Текст, който се показва когато добавим имейла в списъка на блокираните имейли
 # DEFINE('BGERP_BLAST_SUCCESS_REMOVED', 'Имейлът Ви е премахнат от списъка за информационни съобщения. Искате ли да добавите имейла си в листата.');


/*****************************************************************************
 *                                                                           *
 * Клас 'cams_Records' -                                                     *
 *                                                                           *
 * bgerp/cams/Records                                                        *
 *                                                                           *
 *****************************************************************************/

// Колко да е минималното дисково пространство
 # DEFINE('CAMS_MIN_DISK_SPACE', 100*1024*1024*1024);


// Колко клипа да показва на ред при широк екран
 # DEFINE('CAMS_CLIPS_PER_WIDE_ROW', 6);


// Колко клипа да показва на страница при тесен екран
 # DEFINE('CAMS_CLIPS_PER_NARROW_PAGE', 12);


// Колко е продължителността на конвертирането на един клип в сек.
 # DEFINE('CAMS_CLIP_TO_FLV_DURATION', round(cams_CLIP_DURATION/30);


// Колко да е продължителността на един клип в сек.
 # DEFINE('CAMS_CLIP_DURATION', 5*60);


// Път до директория, където ще се записват jpeg превютата
 # DEFINE('CAMS_IMAGES_PATH', EF_UPLOADS_PATH."/cams/images");


// Директория за flv файловете
 # DEFINE('SBF_CAMS_FLV_DIR', "_cams/flv");


// Път до директория, където ще се съхраняват записите от камерите
 # DEFINE('CAMS_VIDEOS_PATH', EF_UPLOADS_PATH."/cams/videos");


// Колко клипа да показва на страница при широк екран
 # DEFINE('CAMS_CLIPS_PER_WIDE_PAGE', 144);


// Път до директория, където ще се записват flv файловете
 # DEFINE('SBF_CAMS_FLV_PATH', EF_SBF_PATH.'/'.SBF_CAMS_FLV_DIR);


// Колко клипа да показва на ред при тесен екран
 # DEFINE('CAMS_CLIPS_PER_NARROW_ROW', 1);


/*****************************************************************************
 *                                                                           *
 * Фирми                                                                     *
 *                                                                           *
 * bgerp/crm/Companies                                                       *
 *                                                                           *
 *****************************************************************************/

// Държавата на собствената компания (тази за която ще работи bgERP)
 # DEFINE('BGERP_OWN_COMPANY_COUNTRY', 'Bulgaria');


// Константи за инициализиране на таблицата с контактите
 # DEFINE('BGERP_OWN_COMPANY_ID', '1');


// Име на собствената компания (тази за която ще работи bgERP)
 # DEFINE('BGERP_OWN_COMPANY_NAME', 'Моята Фирма ООД');


/*****************************************************************************
 *                                                                           *
 * Клас 'currency_CurrencyRates' -                                           *
 *                                                                           *
 * bgerp/currency/CurrencyRates                                              *
 *                                                                           *
 *****************************************************************************/

// Задаване на основна валута
 # DEFINE('BGERP_BASE_CURRENCY', 'BGN');


/*****************************************************************************
 *                                                                           *
 * Ръчен постинг в документната система                                      *
 *                                                                           *
 * bgerp/doc/Postings                                                        *
 *                                                                           *
 *****************************************************************************/

// Текста, който ще се показва в хедърната част на постингите
 # DEFINE('BGERP_POSTINGS_HEADER_TEXT', 'Препратка');


/*****************************************************************************
 *                                                                           *
 * Email адреси                                                              *
 *                                                                           *
 * bgerp/email/Inboxes                                                       *
 *                                                                           *
 *****************************************************************************/

// Пощенска кутия по - подразбиране
 # DEFINE('BGERP_DEFAULT_EMAIL_DOMAIN', 'bgerp.com');


/*****************************************************************************
 *                                                                           *
 * Входящи писма                                                             *
 *                                                                           *
 * bgerp/email/Incomings                                                     *
 *                                                                           *
 *****************************************************************************/

// Максимално време за еднократно фетчване на писма
 # DEFINE('IMAP_MAX_FETCHING_TIME', 30);


// Максималната разрешена памет за използване
 # DEFINE('MAX_ALLOWED_MEMORY', '800M');


// @todo Чака за документация...
 # DEFINE('UNSORTABLE_COUNTRY_EMAILS', static::UnsortableCountryFolderName);


/*****************************************************************************
 *                                                                           *
 * Входящи писма                                                             *
 *                                                                           *
 * bgerp/email/Messages                                                      *
 *                                                                           *
 *****************************************************************************/

// Максималната разрешена памет за използване
 # DEFINE('MAX_ALLOWED_MEMORY', '800M');


// Максимално време за еднократно фетчване на писма
 # DEFINE('IMAP_MAX_FETCHING_TIME', 30);


// @todo Чака за документация...
 # DEFINE('UNSORTABLE_COUNTRY_EMAILS', static::UnsortableCountryFolderName);


/*****************************************************************************
 *                                                                           *
 * Ръчен постинг в документната система                                      *
 *                                                                           *
 * bgerp/email/Outgoings                                                     *
 *                                                                           *
 *****************************************************************************/

// Текста, който ще се показва в хедърната част на постингите
 # DEFINE('BGERP_POSTINGS_HEADER_TEXT', '|*Препратка|');


/*****************************************************************************
 *                                                                           *
 * Клас 'email_Pop3' - Използване на pop3                                    *
 *                                                                           *
 * bgerp/email/Pop3                                                          *
 *                                                                           *
 *****************************************************************************/

// Максималното време за изчакване на буфера
 # DEFINE('POP3_TIMEOUT', 2);


/*****************************************************************************
 *                                                                           *
 * Клас 'email_UserInboxPlg'                                                 *
 * Създава пощенска кутия след създаване на нов потребител                   *
 *                                                                           *
 * bgerp/email/UserInboxPlg                                                  *
 *                                                                           *
 *****************************************************************************/

// Пощенска кутия по - подразбиране
 # DEFINE('BGERP_DEFAULT_EMAIL_DOMAIN', 'bgerp.com');


/*****************************************************************************
 *                                                                           *
 *                                                                           *
 *                                                                           *
 * bgerp/tests/config/boot                                                   *
 *                                                                           *
 *****************************************************************************/

// По подразбиране от локалния хост се работи в режим DEBUG
 # DEFINE('EF_DEBUG_HOSTS', );



/*****************************************************************************
 *                                                                           *
 * Конфигурация на VENDORS                                                   *
 *                                                                           *
 *****************************************************************************/ 


/*****************************************************************************
 *                                                                           *
 * Клас 'avatar_Plugin' -                                                    *
 *                                                                           *
 * vendors/avatar/Plugin                                                     *
 *                                                                           *
 *****************************************************************************/

// @todo Чака за документация...
 # DEFINE('AVATAR_URL', EF_DOWNLOAD_ROOT.'/'.'AVATAR');


// @todo Чака за документация...
 # DEFINE('AVATAR_DIR', EF_DOWNLOAD_DIR.'/'.'AVATAR');


/*****************************************************************************
 *                                                                           *
 * Клас 'captcha_Type' -                                                     *
 *                                                                           *
 * vendors/captcha/Type                                                      *
 *                                                                           *
 *****************************************************************************/

// С какъв тип да се правят записите в кеша?
 # DEFINE('CAPTCHA_CACHE_TYPE', 'Captcha');


// Колко да е широко изображението?
 # DEFINE('CAPTCHA_WIDTH', round(0.70*CAPTCHA_HEIGHT*CAPTCHA_LENGTH);


// Колко да са високи символите?
 # DEFINE('CAPTCHA_HEIGHT', 28);


// Колко символа да е дълга капчата?
 # DEFINE('CAPTCHA_LENGTH', 4);


// Колко минути да е активна информацията в кеша?
 # DEFINE('CAPTCHA_LIFETIME', 10);


/*****************************************************************************
 *                                                                           *
 * Клас 'chosen_Plugin' - избор на дата                                      *
 *                                                                           *
 * vendors/chosen/Plugin                                                     *
 *                                                                           *
 *****************************************************************************/

// Минималния брой елементи, за които няма да сработи Chosen
 # DEFINE('EF_MIN_COUNT_LIST_CHOSEN', 16);


// @todo Чака за документация...
 # DEFINE('CHOSEN_PATH', 'chosen/0.9.3');


/*****************************************************************************
 *                                                                           *
 * Клас 'docview_Viewer' - За разглеждане на изображения посредством zoom.it *
 *                                                                           *
 * vendors/docview/Viewer                                                    *
 *                                                                           *
 *****************************************************************************/

// Дефинира име на папка в която ще се съхраняват данните
 # DEFINE('DOCVIEW_TEMP_DIR', );


/*****************************************************************************
 *                                                                           *
 * Клас 'drdata_Emails' -                                                    *
 *                                                                           *
 * vendors/drdata/Emails                                                     *
 *                                                                           *
 *****************************************************************************/

// @todo Чака за документация...
 # DEFINE('SENDER_EMAIL', "team@extrapack.com");


// @todo Чака за документация...
 # DEFINE('SENDER_HOST', "colocation.download.bg");


/*****************************************************************************
 *                                                                           *
 * Клас 'editwatch_Editors' -                                                *
 *                                                                           *
 * vendors/editwatch/Editors                                                 *
 *                                                                           *
 *****************************************************************************/

// Колко секунди да пази записите в таблицата минимално
 # DEFINE('EDITWATCH_REC_LIFETIME', 5*60);


/*****************************************************************************
 *                                                                           *
 * Клас 'core_Expert'                                                        *
 *                                                                           *
 * vendors/expert/Expert                                                     *
 *                                                                           *
 *****************************************************************************/

// Тип на записа в кеша
 # DEFINE('EXPERT_CACHE_TYPE', 'Expert');


// Дефинира колко минути е 'живо' състоянието
 # DEFINE('EXPERT_STATE_LIFETIME', 45);


// Къде да се съхранява състоянието на експертизата?
 # DEFINE('EXPERT_SAVE_STATE_IN_CACHE', TRUE);


/*****************************************************************************
 *                                                                           *
 * Клас 'fancybox_Fancybox'                                                  *
 *                                                                           *
 * vendors/fancybox/Fancybox                                                 *
 *                                                                           *
 *****************************************************************************/

// Път до външния пакет
 # DEFINE('FANCYBOX_PATH', 'fancybox/1.3.4');


/*****************************************************************************
 *                                                                           *
 * Показва стартираните процеси                                              *
 *                                                                           *
 * vendors/fconv/Processes                                                   *
 *                                                                           *
 *****************************************************************************/

// @todo Чака за документация...
 # DEFINE('FCONV_HANDLER_LEN', 8);


/*****************************************************************************
 *                                                                           *
 * Клас 'fileman_Data' - Указател към данните за всеки файл                  *
 *                                                                           *
 * vendors/fileman/Data                                                      *
 *                                                                           *
 *****************************************************************************/

// Пътя до директорията за файловете е общ за всички инсталирани приложения
 # DEFINE('FILEMAN_UPLOADS_PATH', substr(EF_UPLOADS_PATH,0,strrpos(EF_UPLOADS_PATH,'/');


/*****************************************************************************
 *                                                                           *
 * Клас 'fileman_Download' -                                                 *
 *                                                                           *
 * vendors/fileman/Download                                                  *
 *                                                                           *
 *****************************************************************************/

// @todo Чака за документация...
 # DEFINE('EF_DOWNLOAD_DIR', EF_INDEX_PATH.'/'.EF_SBF.'/'.EF_APP_NAME.'/'.EF_DOWNLOAD_ROOT);


// @todo Чака за документация...
 # DEFINE('EF_DOWNLOAD_PREFIX_PTR', '$*****');


// @todo Чака за документация...
 # DEFINE('EF_DOWNLOAD_ROOT', '_dl_');


/*****************************************************************************
 *                                                                           *
 * Клас 'fileman_Files' -                                                    *
 *                                                                           *
 * vendors/fileman/Files                                                     *
 *                                                                           *
 *****************************************************************************/

// Каква да е дължината на манипулатора на файла?
 # DEFINE('FILEMAN_HANDLER_PTR', '$*****');


/*****************************************************************************
 *                                                                           *
 * Клас 'fileman_SetExtensionPlg'                                            *
 * Проверка и коригиране на разширението на файла                            *
 *                                                                           *
 * vendors/fileman/SetExtensionPlg                                           *
 *                                                                           *
 *****************************************************************************/

// Задава командата за определяне на mime типа
 # DEFINE('EF_EXTENSION_FILE_PROGRAM', 'file');


/*****************************************************************************
 *                                                                           *
 * Клас 'flexpaper_Render'                                                   *
 *                                                                           *
 * vendors/flexpaper/Render                                                  *
 *                                                                           *
 *****************************************************************************/

// Път до външния файл
 # DEFINE('FLEXPAPER_PATH', sbf("flexpaper/1.4.5/FlexPaperViewer.swf");


/*****************************************************************************
 *                                                                           *
 * Генерира необходимият код за плейване на flv файлове                      *
 *                                                                           *
 * vendors/flvplayer/Embedder                                                *
 *                                                                           *
 *****************************************************************************/

// @todo Чака за документация...
 # DEFINE('FLVPLAYER_PATH', sbf);


/*****************************************************************************
 *                                                                           *
 * Клас 'hclean_Purifier' - Пречистване на HTML                              *
 *                                                                           *
 * vendors/hclean/Purifier                                                   *
 *                                                                           *
 *****************************************************************************/

// Папка за съхранение на временните файлове
 # DEFINE('PURIFIER_TEMP_PATH', EF_TEMP_PATH.'/purifer');


/*****************************************************************************
 *                                                                           *
 * Клас 'jqdatepick_Plugin' - избор на дата                                  *
 *                                                                           *
 * vendors/jqdatepick/Plugin                                                 *
 *                                                                           *
 *****************************************************************************/

// @todo Чака за документация...
 # DEFINE('JQDATEPICKER_VERSION', 'v4.0.6');


/*****************************************************************************
 *                                                                           *
 * Клас 'jsgauge_Gauge'                                                      *
 *                                                                           *
 * vendors/jsgauge/Gauge                                                     *
 *                                                                           *
 *****************************************************************************/

// Път до външния файл
 # DEFINE('GAUGE_PATH', 'jsgauge/0.4.1');


/*****************************************************************************
 *                                                                           *
 * Клас 'keyboard_Plugin' -                                                  *
 *                                                                           *
 * vendors/keyboard/Plugin                                                   *
 *                                                                           *
 *****************************************************************************/

// @todo Чака за документация...
 # DEFINE('VKI_VERSION', '1.28');


/*****************************************************************************
 *                                                                           *
 * Хранилището за перманентни данни.                                         *
 *                                                                           *
 * vendors/permanent/Data                                                    *
 *                                                                           *
 *****************************************************************************/

// Какъв е максималния рамер на некомпресираните данни в байтове
 # DEFINE('DATA_MAX_UNCOMPRESS', 10000);


/*****************************************************************************
 *                                                                           *
 * Клас 'php_Formater' - Форматер за приложения на EF                        *
 *                                                                           *
 * vendors/php/Formater                                                      *
 *                                                                           *
 *****************************************************************************/

// Обща директория на bgerp, vendors, ef. Използва се за едновремнно форматиране на трите пакета.
 # DEFINE('EF_ALL_PATH', EF_ROOT_PATH.'/all');


/*****************************************************************************
 *                                                                           *
 * Клас 'php_Formater' - Форматер за приложения на EF                        *
 *                                                                           *
 * vendors/php/Test                                                          *
 *                                                                           *
 *****************************************************************************/

// Обща директория на bgerp, vendors, ef. Използва се за едновремнно форматиране на трите пакета.
 # DEFINE('EF_ALL_PATH', EF_ROOT_PATH.'/all');


/*****************************************************************************
 *                                                                           *
 * Клас от EF, който агрегира PHP Mailer Lite                                *
 *                                                                           *
 * vendors/phpmailer/Instance                                                *
 *                                                                           *
 *****************************************************************************/

// Подразбиращата се кодировка на съобщенията
 # DEFINE('PML_CHARSET', 'utf-8');


// Ника на изпращача по подразбиране
 # DEFINE('PML_DEF_NICK', 'support');


// Адреса във 'From' хедъра на съобщението
 # DEFINE('PML_FROM_EMAIL', PML_DEF_NICK.'@'.$_SERVER['SERVER_NAME']);


// Името във 'From' хедъра на съобщението
 # DEFINE('PML_FROM_NAME', EF_APP_TITLE.' '.mb_convert_case(PML_DEF_NICK,MB_CASE_TITLE,PML_CHARSET);


// Адреса на изпращача (Return-Path) на съобщението
 # DEFINE('PML_SENDER', PML_FROM_EMAIL);


// Какъв да е метода за изпращане на писма?
// ("mail", "sendmail", or "smtp")
 # DEFINE('PML_MAILER', 'sendmail');


// Къде се намира Sendmail?
 # DEFINE('SENDMAIL_PATH', '/usr/sbin/sendmail');


// Дефинираме пътя до кода на PHP_Mailer
 # DEFINE('PML_CLASS', '5.2/class.phpmailer.php');


// Да изпраща ли по единично писмата от адесите в 'To:'
 # DEFINE('PML_SINGLE_TO', FALSE);


/*****************************************************************************
 *                                                                           *
 * Клас  'physics_HumidityType' - Тип за температура                         *
 *                                                                           *
 * vendors/physics/HumidityType                                              *
 *                                                                           *
 *****************************************************************************/

// Колко цифри след запетаята да се показват
 # DEFINE('EF_HUMIDITYTYPE_DECIMALS', 0);


/*****************************************************************************
 *                                                                           *
 * Клас  'physics_PressureType' - Тип за температура                         *
 *                                                                           *
 * vendors/physics/PressureType                                              *
 *                                                                           *
 *****************************************************************************/

// Мерната единица по подразбиране
 # DEFINE('EF_DEFAULT_UNIT_PRESSURE', 'bar');


// Колко цифри след запетаята да се показват
 # DEFINE('EF_PRESSURETYPE_DECIMALS', 1);


/*****************************************************************************
 *                                                                           *
 * Клас  'physics_TemperatureType' - Тип за температура                      *
 *                                                                           *
 * vendors/physics/TemperatureType                                           *
 *                                                                           *
 *****************************************************************************/

// Мерната единица по подразбиране
 # DEFINE('EF_DEFAULT_UNIT', '°C');


// Колко цифри след запетаята да се показват
 # DEFINE('EF_TEMPERATURETYPE_DECIMALS', 2);


/*****************************************************************************
 *                                                                           *
 * Клас 'thumbnail_Thumbnail' -                                              *
 *                                                                           *
 * vendors/thumbnail/Thumbnail                                               *
 *                                                                           *
 *****************************************************************************/

// @todo Чака за документация...
 # DEFINE('THUMBNAIL_URL', EF_DOWNLOAD_ROOT.'/'.'TB');


// @todo Чака за документация...
 # DEFINE('THUMBNAIL_FOLDER', EF_DOWNLOAD_DIR.'/'.'TB');


