<?php 

/*****************************************************************************
 *                                                                           *
 *      Примерен конфигурационен файл за системата                           *
 *                                                                           *
 *      След като се попълнят стойностите на константите, този файл          *
 *      трябва да бъде записан в [conf] директорията под име:                *
 *      [име на приложението].cfg.php                                        *
 *                                                                           *
 *****************************************************************************/ 



/*****************************************************************************
 *                                                                           *
 * Задължително въведете стойности на следните константи                     *
 *                                                                           *
 *****************************************************************************/ 

// Името на приложението. Използва се за определяне на други константи
   defIfNot('EF_APP_NAME', '[#EF_APP_NAME#]');

// Име на базата данни. По подразбиране е същото, като името на приложението
   defIfNot('EF_DB_NAME', '[#EF_DB_NAME#]');

// Потребителско име. По подразбиране е същото, като името на приложението
   defIfNot('EF_DB_USER', '[#EF_DB_USER#]');

// По-долу трябва да се постави реалната парола за връзка
// с базата данни на потребителят дефиниран в предходния ред
   defIfNot('EF_DB_PASS', '[#EF_DB_PASS#]'); 
   
// Секретен ключ използван за кодиране в рамките на системата
// Той трябва да е различен, за различните инсталации на системата
// Моля сменето стойността, ако правите нова инсталация.
// След като веднъж е установен, този параметър не трябва да се променя
   defIfNot('EF_SALT', '[#EF_SALT#]');
   
// "Подправка" за кодиране на паролите
   defIfNot('EF_USERS_PASS_SALT', '[#EF_USERS_PASS_SALT#]');
   
// Бранч в който се работи
   defIfNot('BGERP_GIT_BRANCH', '[#BGERP_GIT_BRANCH#]');

// Абсолютен път до GIT
   defIfNot('BGERP_GIT_PATH', '[#BGERP_GIT_PATH#]');
      
// Имейла по подразбиране
// defIfNot('BGERP_DEFAULT_EMAIL_FROM', '[#BGERP_DEFAULT_EMAIL_FROM#]');

// Домейн  по подразбиране
// defIfNot('BGERP_DEFAULT_EMAIL_DOMAIN', '[#BGERP_DEFAULT_EMAIL_DOMAIN#]');

// Пощенска кутия по подразбиране
// defIfNot('BGERP_DEFAULT_EMAIL_USER', '[#BGERP_DEFAULT_EMAIL_USER#]');

// Хост по подразбиране
// defIfNot('BGERP_DEFAULT_EMAIL_HOST', '[#BGERP_DEFAULT_EMAIL_HOST#]');

// Парола по подразбиране
// defIfNot('BGERP_DEFAULT_EMAIL_PASSWORD', '[#BGERP_DEFAULT_EMAIL_PASSWORD#]');
   


/*****************************************************************************
 *                                                                           *
 * Параметри за връзка с базата данни                                        *
 *                                                                           *
 *****************************************************************************/ 

// Сървъра за на базата данни
   defIfNot('EF_DB_HOST', 'localhost');
 
// Кодировка на базата данни
   defIfNot('EF_DB_CHARSET', 'utf8');

/*****************************************************************************
 *                                                                           *
 * Пътища до някои важни части от системата                                  *
 *                                                                           *
 *****************************************************************************/ 

// Път по подразбиране за пакетите от 'private'
 # defIfNot('EF_PRIVATE_PATH', EF_ROOT_PATH . '/private');

// Базова директория, където се намират по-директориите за
// временните файлове. По подразбиране е в
// EF_ROOT_PATH/temp
   defIfNot( 'EF_TEMP_BASE_PATH', EF_ROOT_PATH . '/temp');

// Базова директория, където се намират по-директориите за
// потребителски файлове. По подразбиране е в
// EF_ROOT_PATH/uploads
 # defIfNot( 'EF_UPLOADS_BASE_PATH', 'PATH_TO_FOLDER');

// Твърдо, фиксирано име на мениджъра с контролерните функции. 
// Ако се укаже, цялотоможе да има само един такъв 
// мениджър функции. Това е удобство за специфични приложения, 
// при които не е добре името на мениджъра да се вижда в URL-то
 # defIfNot('EF_CTR_NAME', 'FIXED_CONTROLER');


/**
* URL за отдалечено репортване на грешки
*/
defIfNot('EF_REMOTE_ERROR_REPORT_URL','http://experta.bg/ci_Errors/add/apiKey/rmon123/');


/**
 * Отдалечен сървър за генериране на лого на фирма
 */
defIfNot('CRM_REMOTE_COMPANY_LOGO_CREATOR', 'http://experta.bg/api_Companies/getLogo/apiKey/crm123/');


/*****************************************************************************
 *                                                                           *
 * Конфигурация на EF                                                        *
 *                                                                           *
 *****************************************************************************/ 


/*****************************************************************************
 *                                                                           *
 *                                                                           *
 *                                                                           *
 * ef/core/App                                                               *
 *                                                                           *
 *****************************************************************************/

// 
 # defIfNot('BGERP_ABSOLUTE_HTTP_HOST', $_SERVER['HTTP_HOST']);


/*****************************************************************************
 *                                                                           *
 * Клас 'core_Cache'                                                         *
 * Кеширане на обекти, променливи или масиви за определено време             *
 *                                                                           *
 * ef/core/Cache                                                             *
 *                                                                           *
 *****************************************************************************/

// Колко голям да бъде максималния обект, който се съхранява
// в кеша не-компресиран?
 # defIfNot('EF_CACHE_MAX_UNCOMPRESS', 10000);


// Максимален размер за полето на типа
 # defIfNot('EF_CACHE_TYPE_SIZE', 16);


// Максимален размер за полето на манипулатора
 # defIfNot('EF_CACHE_HANDLER_SIZE', 32);


/*****************************************************************************
 *                                                                           *
 * Клас 'core_Crypt' - Функции за двупосочно криптиране със споделен ключ    *
 *                                                                           *
 * ef/core/Crypt                                                             *
 *                                                                           *
 *****************************************************************************/

// Ключа с който ще се криптира, ако не бъде зададен експлицитно
 # defIfNot('EF_CRYPT_CODE', EF_SALT.'EF_CRYPT_CODE');


/*****************************************************************************
 *                                                                           *
 * Клас 'core_Lg' - Мениджър за многоезичен превод на интерфейса             *
 *                                                                           *
 * ef/core/Lg                                                                *
 *                                                                           *
 *****************************************************************************/

// Интерфейс на какви езици поддържа системата?
 # defIfNot('EF_LANGUAGES', 'bg=Български,en=Английски');


/*****************************************************************************
 *                                                                           *
 * class core_ProtoSetup                                                     *
 *                                                                           *
 * ef/core/ProtoSetup                                                        *
 *                                                                           *
 *****************************************************************************/


/*****************************************************************************
 *                                                                           *
 * class 'core_Setup' - Начално установяване на пакета 'core'                *
 *                                                                           *
 * ef/core/Setup                                                             *
 *                                                                           *
 *****************************************************************************/

// Дали да се презаписват .htaccess файловете?
// Може да се зададе друга стойност в конфигурационния файл (напр. conf/bgerp.cfg.php)
 # defIfNot('CORE_OVERWRITE_HTAACCESS', TRUE);


// SALT ключа за генериране на уникален sid (status id)
 # defIfNot('EF_STATUSE_SALT', '');


// Формат по подразбиране за датите
 # defIfNot('EF_DATE_FORMAT', 'd.m.YEAR');


// Формат по подразбиране за датата при тесни екрани
 # defIfNot('EF_DATE_NARROW_FORMAT', 'd.m.year');


// @todo Чака за документация...
 # defIfNot('TYPE_KEY_MAX_SUGGESTIONS', 1000);


// Езикът по подразбиране е български
 # defIfNot('EF_DEFAULT_LANGUAGE', 'bg');


/*****************************************************************************
 *                                                                           *
 * Клас 'core_Users' - Мениджър за потребителите на системата                *
 *                                                                           *
 * ef/core/Users                                                             *
 *                                                                           *
 *****************************************************************************/

// Дефинира, колко секунди записът за
// текущия потребител да е валиден в сесията
 # defIfNot('EF_USER_REC_REFRESH_TIME', 20);


// Колко секунди след последното действие на потребителя
// ще се пази неговата сесия?
 # defIfNot('EF_USERS_SESS_TIMEOUT', 3600);


// Колко секунди може да е максимално разликата
// във времето между времето изчислено при потребителя
// и това във сървъра при логване. В нормален случай
// това трябва да е повече от времето за http трансфер
// на логин формата и заявката за логване
 # defIfNot('EF_USERS_LOGIN_DELAY', 10);


// 'Подправка' за кодиране на паролите
 # defIfNot('EF_USERS_PASS_SALT', hash('sha256',(EF_SALT . 'EF_USERS_PASS_SALT'));


// Колко пъти по дължината на паролата, тя да се хешира?
 # defIfNot('EF_USERS_HASH_FACTOR', 0);


// Колко да е минималната дължина на паролата?
 # defIfNot('EF_USERS_PASS_MIN_LEN', 6);


// Дали да се използва имейл адресът, вместо ник
 # defIfNot('EF_USSERS_EMAIL_AS_NICK', FALSE);


// Как да се казва променливата на cookieто
 # defIfNot('EF_USERS_COOKIE', 'uid');


// Какво е минималното време в секунди, между хитовете от
// два различни IP адреса, за да не бъде блокирана сметката
 # defIfNot('EF_USERS_MIN_TIME_WITHOUT_BLOCKING', 120);


// Колко дни потребител може да не активира първоначално достъпа си
// преди да бъде изтрит
 # defIfNot('USERS_DRAFT_MAX_DAYS', 3);


/*****************************************************************************
 *                                                                           *
 *                                                                           *
 *                                                                           *
 * ef/core/boot                                                              *
 *                                                                           *
 *****************************************************************************/

// Сетъп ключ, ако не е зададен
 # defIfNot('BGERP_SETUP_KEY', md5(EF_SALT.'*9fbaknc'));


// Директорията с конфигурационните файлове
 # defIfNot('EF_CONF_PATH', EF_ROOT_PATH.'/conf');


// По подразбиране от локалния хост се работи в режим DEBUG
   DEFINE('EF_DEBUG', 'hosts: localhost, 127.0.0.1');
// Разрешава дебъг от всички.   
//   DEFINE('EF_DEBUG', TRUE);
//  FALSE или нещо различно - не може да се дебъгва.
//   DEFINE('EF_DEBUG', FALSE);

   
// Базовото име на директорията за статичните браузърни файлове
 # defIfNot('EF_SBF', 'sbf');


// Пътя до директорията за статичните браузърни файлове към приложението
 # defIfNot('EF_SBF_PATH', EF_INDEX_PATH."/".EF_SBF."/".EF_APP_NAME);


// Дефинира, ако не е зададено името на кода на приложението
 # defIfNot('EF_APP_CODE_NAME', EF_APP_NAME);


// Времева зона
 # defIfNot('EF_TIMEZONE', 'Europe/Sofia');


// Базова директория, където се намират приложенията
 # defIfNot('EF_APP_BASE_PATH', EF_ROOT_PATH);


// Директорията с приложението
 # defIfNot('EF_APP_PATH', EF_APP_BASE_PATH.'/'.EF_APP_CODE_NAME);


// Базова директория, където се намират под-директориите с временни файлове
 # defIfNot('EF_TEMP_BASE_PATH', EF_ROOT_PATH.'/temp');


// Директорията с временни файлове
 # defIfNot('EF_TEMP_PATH', EF_TEMP_BASE_PATH.'/'.EF_APP_NAME);


// Базова директория, където се намират под-директориите с качените файлове
 # defIfNot('EF_UPLOADS_BASE_PATH', EF_ROOT_PATH.'/uploads');


// Директорията с качените и генерираните файлове
 # defIfNot('EF_UPLOADS_PATH', EF_UPLOADS_BASE_PATH.'/'.EF_APP_NAME);
 
// Времето в секунди за изчакване при рефреш на портала
  defIfNot('BGERP_DOCUMENT_SLEEP_TIME', 0);


/*****************************************************************************
 *                                                                           *
 * Клас 'page_Footer' - Долния завършек на страницата                        *
 *                                                                           *
 * ef/page/InternalFooter                                                    *
 *                                                                           *
 *****************************************************************************/

// @todo Чака за документация...
 # defIfNot('EF_LANGUAGES', 'bg');


/*****************************************************************************
 *                                                                           *
 * Клас 'plg_ExportCsv'                                                      *
 * Дава възможност за експорт към CSV на избрани полета от модела            *
 * които имат атрибут'export=Csv'                                            *
 *                                                                           *
 * ef/plg/ExportCsv                                                          *
 *                                                                           *
 *****************************************************************************/

// @todo Чака за документация...
 # defIfNot('EF_MAX_EXPORT_CNT', 100000);


/*****************************************************************************
 *                                                                           *
 * Клас 'type_Double' - Тип за рационални числа                              *
 *                                                                           *
 * ef/type/Double                                                            *
 *                                                                           *
 *****************************************************************************/

// Колко цифри след запетаята да показваме по подразбиране?
 # defIfNot('EF_NUMBER_DECIMALS', 4);


// Кой символ за десетична точка да използваме?
 # defIfNot('EF_NUMBER_DEC_POINT', ',');


// Кой символ да използваме за разделител на хилядите?
 # defIfNot('EF_NUMBER_THOUSANDS_SEP', ' ');


/*****************************************************************************
 *                                                                           *
 * Клас  'type_Int' - Тип за цели числа                                      *
 *                                                                           *
 * ef/type/Int                                                               *
 *                                                                           *
 *****************************************************************************/

// Кой символ да използваме за разделител на хилядите?
 # defIfNot('EF_NUMBER_THOUSANDS_SEP', ' ');


/*****************************************************************************
 *                                                                           *
 * Клас  'type_Password' - Тип за парола                                     *
 *                                                                           *
 * ef/type/Password                                                          *
 *                                                                           *
 *****************************************************************************/

// Служебна константа, за стойност на инпута на паролата
 # defIfNot('EF_PASS_NO_CHANGE', 'no_change');


/*****************************************************************************
 *                                                                           *
 * Клас  'type_Percent' - Тип за проценти                                    *
 *                                                                           *
 * ef/type/Percent                                                           *
 *                                                                           *
 *****************************************************************************/

// @todo Чака за документация...
 # defIfNot('EF_PERCENT_DECIMALS', 2);



/*****************************************************************************
 *                                                                           *
 * Конфигурация на BGERP                                                     *
 *                                                                           *
 *****************************************************************************/ 


/*****************************************************************************
 *                                                                           *
 * class acc_Setup                                                           *
 *                                                                           *
 * bgerp/acc/Setup                                                           *
 *                                                                           *
 *****************************************************************************/

// Задаване начало на първия активен счетоводен период
defIfNot('ACC_FIRST_PERIOD_START', '');


// Стойност по подразбиране на актуалния ДДС (между 0 и 1)
// Използва се по време на инициализацията на системата, при създаването на първия период
defIfNot('ACC_DEFAULT_VAT_RATE', 0.20);


/*****************************************************************************
 *                                                                           *
 * class bank_Setup                                                          *
 *                                                                           *
 * bgerp/bank/Setup                                                          *
 *                                                                           *
 *****************************************************************************/

// На колко процента разлика между очакваната и въведената сума при
// превалутиране да сетва предупреждение
 # defIfNot('BANK_EXCHANGE_DIFFERENCE', '5');


/*****************************************************************************
 *                                                                           *
 * class 'bgerp_Setup' - Начално установяване на 'bgerp'                     *
 *                                                                           *
 * bgerp/bgerp/Setup                                                         *
 *                                                                           *
 *****************************************************************************/

// FileHandler на логото на фирмата на английски
 # defIfNot('BGERP_COMPANY_LOGO_EN', '');


// FileHandler на логото на фирмата на български
 # defIfNot('BGERP_COMPANY_LOGO', '');


/*****************************************************************************
 *                                                                           *
 * class blast_Setup                                                         *
 *                                                                           *
 * bgerp/blast/Setup                                                         *
 *                                                                           *
 *****************************************************************************/

// Текст за отписване от информационните съобщение
 # defIfNot('BGERP_BLAST_UNSUBSCRIBE', 'Искате ли да премахнете имейл-а си от листата за получаване на информационни съобщения?');


// Текст, който се показва, ако не може да се намери имейл адреса в системата
 # defIfNot('BGERP_BLAST_NO_MAIL', 'Не може да се намери имейл адреса Ви.');


// Teкст, който се показва когато премахнем имейл-а от блокираните
 # defIfNot('BGERP_BLAST_SUCCESS_ADD', 'Имейлът Ви е добавен в списъка за информационни съобщения. Искате ли да го премахнете?');


// Текст, който се показва когато добавим имейл-а в списъка на блокираните имейли
 # defIfNot('BGERP_BLAST_SUCCESS_REMOVED', 'Имейлът Ви е премахнат от списъка за информационни съобщения. Искате ли да добавите имейл-а си в листата?');


/*****************************************************************************
 *                                                                           *
 * class blogm_Setup                                                         *
 *                                                                           *
 * bgerp/blogm/Setup                                                         *
 *                                                                           *
 *****************************************************************************/

// Константи за брой дни след които статията се заключва за коментиране
 # defIfNot('BLOGM_MAX_COMMENT_DAYS', '50');


// Константа за тема по-подразбиране на блога
 # defIfNot('BLOGM_DEFAULT_THEME', 'blogm/themes/default');


// Константа за продължителноста на живота на бисквитките създадени от блога
 # defIfNot('BLOGM_COOKIE_LIFETIME', '2592000');


// Броя на статии, които да се показват
 # defIfNot('BLOGM_ARTICLES_PER_PAGE', '5');


/*****************************************************************************
 *                                                                           *
 * Мениджър за записване на обажданията                                      *
 *                                                                           *
 * bgerp/callcenter/Talks                                                    *
 *                                                                           *
 *****************************************************************************/

// Защитен ключ за регистриране на обаждания
 # defIfNot('CALLCENTER_PROTECT_KEY', md5(EF_SALT.'callCenter'));


/*****************************************************************************
 *                                                                           *
 * Клас 'cams_Records' -                                                     *
 *                                                                           *
 * bgerp/cams/Records                                                        *
 *                                                                           *
 *****************************************************************************/

// Път до директория, където ще се съхраняват записите от камерите
 # defIfNot('CAMS_VIDEOS_PATH', EF_UPLOADS_PATH."/cams/videos");


// Път до директория, където ще се записват jpeg превютата
 # defIfNot('CAMS_IMAGES_PATH', EF_UPLOADS_PATH."/cams/images");


// Директория за flv файловете
 # defIfNot('SBF_CAMS_FLV_DIR', "_cams/flv");


// Път до директория, където ще се записват flv файловете
 # defIfNot('SBF_CAMS_FLV_PATH', EF_SBF_PATH.'/'.SBF_CAMS_FLV_DIR);


// Колко е продължителността на конвертирането на един клип в секунди
 # defIfNot('CAMS_CLIP_TO_FLV_DURATION', round(cams_CLIP_DURATION/30));


/*****************************************************************************
 *                                                                           *
 * class acc_Setup                                                           *
 *                                                                           *
 * bgerp/cams/Setup                                                          *
 *                                                                           *
 *****************************************************************************/

// Колко да е продължителността на един клип в секунди
 # defIfNot('CAMS_CLIP_DURATION', 5*60);


// Колко клипа да показва на страница при широк екран
 # defIfNot('CAMS_CLIPS_PER_WIDE_PAGE', 144);


// Колко клипа да показва на страница при тесен екран
 # defIfNot('CAMS_CLIPS_PER_NARROW_PAGE', 12);


// Колко клипа да показва на ред при широк екран
 # defIfNot('CAMS_CLIPS_PER_WIDE_ROW', 6);


// Колко клипа да показва на ред при тесен екран
 # defIfNot('CAMS_CLIPS_PER_NARROW_ROW', 1);


// Колко да е минималното дисково пространство
 # defIfNot('CAMS_MIN_DISK_SPACE', 100*1024*1024*1024);


/*****************************************************************************
 *                                                                           *
 * class cms_Setup                                                           *
 *                                                                           *
 * bgerp/cms/Setup                                                           *
 *                                                                           *
 *****************************************************************************/

// Тема по подразбиране
 # defIfNot('CMS_THEME', 'cms/themes/default');


// Изображение което ще се показва в Ографа
 # defIfNot('CMS_OGRAPH_IMAGE', '');


// Код за споделяне на съдържание
 # defIfNot('CMS_SHARE', '');


/*****************************************************************************
 *                                                                           *
 * Фирми                                                                     *
 *                                                                           *
 * bgerp/crm/Companies                                                       *
 *                                                                           *
 *****************************************************************************/


// Име на собствената компания (тази за която ще работи bgERP)
 # defIfNot('BGERP_OWN_COMPANY_NAME', 'Моята Фирма ООД');


/*****************************************************************************
 *                                                                           *
 * Клас 'crm_Setup' -                                                        *
 *                                                                           *
 * bgerp/crm/Setup                                                           *
 *                                                                           *
 *****************************************************************************/


// Име на собствената компания (тази за която ще работи bgERP)
 # defIfNot('BGERP_OWN_COMPANY_NAME', 'Моята Фирма ООД');


// Държавата на собствената компания (тази за която ще работи bgERP)
 # defIfNot('BGERP_OWN_COMPANY_COUNTRY', 'Bulgaria');


/*****************************************************************************
 *                                                                           *
 * class currency_Setup                                                      *
 *                                                                           *
 * bgerp/currency/Setup                                                      *
 *                                                                           *
 *****************************************************************************/

// Задаване на основна валута
 # defIfNot('CURRENCY_BASE_CODE', 'BGN');


// На колко процента разлика между очакваната и въведената сума при
// превалутиране да сетва предупреждение
 # defIfNot('EXCHANGE_DEVIATION', '0.05');


/*****************************************************************************
 *                                                                           *
 * class dma_Setup                                                           *
 *                                                                           *
 * bgerp/doc/Setup                                                           *
 *                                                                           *
 *****************************************************************************/

// Роля за основен екип
 # defIfNot('BGERP_ROLE_HEADQUARTER', 'Headquarter');


// Кой пакет да използваме за генериране на PDF от HTML ?
 # defIfNot('BGERP_PDF_GENERATOR', 'dompdf');


/*****************************************************************************
 *                                                                           *
 * Описание на IMAP/POP3 акаунти за входящи имейли                           *
 *                                                                           *
 * bgerp/email/Accounts                                                      *
 *                                                                           *
 *****************************************************************************/

// Дали да се рутират писмата, получени на този акаунт
 # defIfNot('BGERP_DEFAULT_EMAIL_APPLY_ROUTING', 'yes');


// Дали към този акаунт отговаря и за други вътрешни адреси, освен посочения в email?
// 
// Самостоятелна сметка: Отговаря само за имейл адреса, с който е дефинирана
// 
// Събирателна сметка: Отговаря и за други имейл адреси
// 
// Корпоративна сметка: Отговаря за много други имейл адреси, и кутията по подразбиране на потребителите е в същия домейн, като на тази сметка
 # defIfNot('BGERP_DEFAULT_EMAIL_TYPE', 'corporate');


// 
 # defIfNot('BGERP_DEFAULT_EMAIL_PROTOCOL', 'imap');


// 
 # defIfNot('BGERP_DEFAULT_EMAIL_SECURITY', ($port==995||$port==993);


// 
 # defIfNot('BGERP_DEFAULT_EMAIL_CERT', 'noValidate');


// 
 # defIfNot('BGERP_DEFAULT_EMAIL_FOLDER', 'inbox');


// 
 # defIfNot('BGERP_DEFAULT_EMAIL_DELETE', 'no');


// 
 # defIfNot('BGERP_DEFAULT_EMAIL_SMTP_SECURE', 'no');


// 
 # defIfNot('BGERP_DEFAULT_EMAIL_SMTP_AUTH', 'no');


// 
 # defIfNot('BGERP_DEFAULT_EMAIL_SMTP_USER', NULL);


// 
 # defIfNot('BGERP_DEFAULT_EMAIL_SMTP_PASSWORD', NULL);


// Изпращане
 # defIfNot('BGERP_DEFAULT_EMAIL_SMTP_SERVER', 'localhost');


/*****************************************************************************
 *                                                                           *
 * Начални обръщения в изходящите писма, които правим                        *
 *                                                                           *
 * bgerp/email/Salutations                                                   *
 *                                                                           *
 *****************************************************************************/

// defIfNot('EMAIL_SALUTATIONS_BEGIN', 'Здравейте,Здравей,Привет,Скъпи,Скъпа,Скъпо,Уважаеми,Уважаема,Уважаемо,Dear,Gentlemen,Ladies,Hi');
 # defIfNot('EMAIL_SALUTATIONS_BEGIN', 'Здравей,Привет,Скъп,Уважаем,Dear,Gentlemen,Ladies,Hi');


/*****************************************************************************
 *                                                                           *
 * class email_Setup                                                         *
 *                                                                           *
 * bgerp/email/Setup                                                         *
 *                                                                           *
 *****************************************************************************/

// Максимално време за еднократно фетчване на писма
 # defIfNot('EMAIL_MAX_FETCHING_TIME', 30);


// Максималната разрешена памет за използване
 # defIfNot('EMAIL_MAX_ALLOWED_MEMORY', '800M');


// Шаблон за име на папките, където отиват писмата от дадена държава и неподлежащи на
// по-адекватно сортиране
 # defIfNot('EMAIL_UNSORTABLE_COUNTRY', 'Несортирани - %s');


// Максималното време за изчакване на буфера
 # defIfNot('EMAIL_POP3_TIMEOUT', 2);


// Максималната големина на файловете, които ще се приемат за CID
// 10kB
 # defIfNot('EMAIL_MAXIMUM_CID_LEN', 10240);


// Ниво за score на SpamAssassin, над което писмото се обявява за твърд СПАМ
 # defIfNot('SPAM_SA_SCORE_LIMIT', 7);


/*****************************************************************************
 *                                                                           *
 * Клас 'email_UserInboxPlg'                                                 *
 * Създава пощенска кутия след създаване на нов потребител                   *
 *                                                                           *
 * bgerp/email/UserInboxPlg                                                  *
 *                                                                           *
 *****************************************************************************/

// Роля за основен екип
 # defIfNot('BGERP_ROLE_HEADQUARTER', 'Headquarter');


/*****************************************************************************
 *                                                                           *
 * class forum_Setup                                                         *
 *                                                                           *
 * bgerp/forum/Setup                                                         *
 *                                                                           *
 *****************************************************************************/

// Константа за тема по-подразбиране на блога
 # defIfNot('FORUM_DEFAULT_THEME', 'forum/themes/default');


// 
 # defIfNot('FORUM_THEMES_PER_PAGE', '10');


// 
 # defIfNot('FORUM_GREETING_MESSAGE', 'Добре дошли в нашия форум');


// 
 # defIfNot('FORUM_POSTS_PER_PAGE', '10');


/*****************************************************************************
 *                                                                           *
 * История от събития, свързани с документите                                *
 *                                                                           *
 * bgerp/log/Documents                                                       *
 *                                                                           *
 *****************************************************************************/

// Колко дни да се пази в лога в core_Logs
 # defIfNot('DOCLOG_DOCUMENTS_DAYS', 5);


/*****************************************************************************
 *                                                                           *
 * Исторически данни за одит и обратна връзка                                *
 *                                                                           *
 * bgerp/log/Setup                                                           *
 *                                                                           *
 *****************************************************************************/

// След колко време (в секунди) след първото изпращане към един имейл да се взема в предвид, че е изпратено преди (Повторно изпращане)
// 
// По подразбиране 12 часа
 # defIfNot('LOG_EMAIL_RESENDING_TIME', '43200');


/*****************************************************************************
 *                                                                           *
 * Клас 'page_InternalFooter' - Долния завършек на страницата                *
 *                                                                           *
 * bgerp/page/InternalFooter                                                 *
 *                                                                           *
 *****************************************************************************/

// @todo Чака за документация...
 # defIfNot('EF_LANGUAGES', 'bg,en');


/*****************************************************************************
 *                                                                           *
 * Модул "Точки на продажба" - инсталиране/деинсталиране                     *
 *                                                                           *
 * bgerp/pos/Setup                                                           *
 *                                                                           *
 *****************************************************************************/

// Отстъпка за периода
 # defIfNot('POS_WAT_PERCENT', '20');


// Константа за тема по-подразбиране на блога
 # defIfNot('POS_PRODUCTS_DEFAULT_THEME', 'pos/themes/default');


/*****************************************************************************
 *                                                                           *
 * Инсталиране на модул 'price'                                              *
 *                                                                           *
 * bgerp/price/Setup                                                         *
 *                                                                           *
 *****************************************************************************/

// @todo Чака за документация...
 # defIfNot('PRICE_LIST_COST', 1);


// 
 # defIfNot('PRICE_LIST_CATALOG', 2);


/*****************************************************************************
 *                                                                           *
 * class survey_Setup                                                        *
 *                                                                           *
 * bgerp/survey/Setup                                                        *
 *                                                                           *
 *****************************************************************************/

// До колко минути след първото гласуване, потребителя може да си смени
// гласа
 # defIfNot('SURVEY_VOTE_CHANGE', '2');



/*****************************************************************************
 *                                                                           *
 * Конфигурация на VENDORS                                                   *
 *                                                                           *
 *****************************************************************************/ 


/*****************************************************************************
 *                                                                           *
 * Извличана на информация от файлове                                        *
 *                                                                           *
 * vendors/apachetika/Detect                                                 *
 *                                                                           *
 *****************************************************************************/

// Версията на програмата
 # defIfNot('APACHE_TIKA_VERSION', '1.2');


/*****************************************************************************
 *                                                                           *
 * Адаптер за разглеждане и разархивиране на архиви                          *
 *                                                                           *
 * vendors/archive/Adapter                                                   *
 *                                                                           *
 *****************************************************************************/

// Директория, в която ще се държат екстрактнатите файлове
 # defIfNot('ARCHIVE_TEMP_PATH', EF_TEMP_PATH.'/archive');


// Пътя до 7z пакета
 # defIfNot('ARCHIVE_7Z_PATH', '7z');


/*****************************************************************************
 *                                                                           *
 * Клас 'avatar_Plugin' -                                                    *
 *                                                                           *
 * vendors/avatar/Plugin                                                     *
 *                                                                           *
 *****************************************************************************/

// @todo Чака за документация...
 # defIfNot('AVATAR_DIR', EF_DOWNLOAD_DIR.'/'.'AVATAR');


// @todo Чака за документация...
 # defIfNot('AVATAR_URL', EF_DOWNLOAD_ROOT.'/'.'AVATAR');


/*****************************************************************************
 *                                                                           *
 * Клас 'barcode_Generator' - Генериране на баркодове                        *
 *                                                                           *
 * vendors/barcode/Generator                                                 *
 *                                                                           *
 *****************************************************************************/

// Версията на пакета за генериране на баркодове
 # defIfNot('PHP_BARCODE_VERSION', '2.0.1');


// Версията на пакета за генериране на баркодове
 # defIfNot('PHP_QRCODE_VERSION', '1.1.4');


/*****************************************************************************
 *                                                                           *
 * Клас 'barcode_Qr' - Генериране на QR изображения                          *
 *                                                                           *
 * vendors/barcode/Qr                                                        *
 *                                                                           *
 *****************************************************************************/

// @todo Чака за документация...
 # defIfNot('BARCODE_SALT', EF_SALT.'_BARCODE');


/*****************************************************************************
 *                                                                           *
 * Клас 'captcha_Type' -                                                     *
 *                                                                           *
 * vendors/captcha/Type                                                      *
 *                                                                           *
 *****************************************************************************/

// Колко минути да е активна информацията в кеша?
 # defIfNot('CAPTCHA_LIFETIME', 10);


// Колко символа да е дълга капчата?
 # defIfNot('CAPTCHA_LENGTH', 4);


// Колко да са високи символите?
 # defIfNot('CAPTCHA_HEIGHT', 28);


// Колко да е широко изображението?
 # defIfNot('CAPTCHA_WIDTH', round(0.70*CAPTCHA_HEIGHT*CAPTCHA_LENGTH));


// С какъв тип да се правят записите в кеша?
 # defIfNot('CAPTCHA_CACHE_TYPE', 'Captcha');


/*****************************************************************************
 *                                                                           *
 * Клас 'chosen_Plugin' - избор на дата                                      *
 *                                                                           *
 * vendors/chosen/Plugin                                                     *
 *                                                                           *
 *****************************************************************************/

// Пътя до външния код на chosen
 # defIfNot('CHOSEN_PATH', 'chosen/0.9.8');


/*****************************************************************************
 *                                                                           *
 * Клас 'chosen_Plugin' - избор на дата                                      *
 *                                                                           *
 * vendors/chosen/PluginSelect                                               *
 *                                                                           *
 *****************************************************************************/

// Пътя до външния код на chosen
 # defIfNot('CHOSEN_PATH', 'chosen/0.9.8');


/*****************************************************************************
 *                                                                           *
 * Клас 'chosen_Setup' - Предава по добър изглед на keylist полетата         *
 *                                                                           *
 * vendors/chosen/Setup                                                      *
 *                                                                           *
 *****************************************************************************/

// Минималния брой елементи, за които няма да сработи Chosen
 # defIfNot('CHOSEN_MIN_ITEMS', 32);


/*****************************************************************************
 *                                                                           *
 * @category  bgerp                                                          *
 *                                                                           *
 * vendors/csstoinline/Setup                                                 *
 *                                                                           *
 *****************************************************************************/

// Класа, който ще се използва за конвертиране
 # defIfNot('CSSTOINLINE_CONVERTER_CLASS', 'csstoinline_Emogrifier');


// Версията на emogrifier
 # defIfNot('CSSTOINLINE_EMOGRIFIER_VERSION', '2011.10.26');


// Версията на csstoinline
 # defIfNot('CSSTOINLINE_CSSTOINLINE_VERSION', '1.0.3');


/*****************************************************************************
 *                                                                           *
 * Мениджира офис пакета. Стартира, изключва и рестартира офис пакета.Има брояч за направените обработки с офис пакета.                                *
 *                                                                           *
 *                                                                           *
 *                                                                           *
 * vendors/docoffice/Office                                                  *
 *                                                                           *
 *****************************************************************************/

// Пътя до офис пакет
 # defIfNot('OFFICE_PACKET_PATH', 'soffice');


// Броя на конвертиранията, след които офис пакета ще се ресартира
 # defIfNot('MAX_OFFICE_PACKET_CONVERT_COUNT', 50);


/*****************************************************************************
 *                                                                           *
 * @category  bgerp                                                          *
 *                                                                           *
 * vendors/docoffice/Setup                                                   *
 *                                                                           *
 *****************************************************************************/

// Класа, който ще се използва за конвертиране
 # defIfNot('OFFICE_CONVERTER_CLASS', 'docoffice_Jodconverter');


// Пътя до python' a, който искаме да използваме
 # defIfNot('OFFICE_CONVERTER_PYTHON', '');


// Пътя до unoconv' a, който искаме да използваме
 # defIfNot('OFFICE_CONVERTER_UNOCONV', 'unoconv');


// Версията на JodConverter'а
 # defIfNot('OFFICE_JODCONVERTER_VERSION', '3.0b4');


/*****************************************************************************
 *                                                                           *
 * class dompdf_Setup                                                        *
 *                                                                           *
 * vendors/dompdf/Setup                                                      *
 *                                                                           *
 *****************************************************************************/

// Разделителна способност по подразбиране
 # defIfNot('DOMPDF_DPI', "120");


// @todo Чака за документация...
 # defIfNot('DOMPDF_VER', '3.0');


// Дефинира име на папка в която ще се съхраняват временните данни данните
 # defIfNot('DOMPDF_TEMP_DIR', EF_TEMP_PATH."/dompdf");


// Файла, където се записва лога
 # defIfNot('DOMPDF_LOG_OUTPUT_FILE', DOMPDF_TEMP_DIR."/log.htm");


// Възможност да се използват ресурси от Интернет
 # defIfNot('DOMPDF_ENABLE_REMOTE', TRUE);


/*****************************************************************************
 *                                                                           *
 * class drdata_Setup                                                        *
 *                                                                           *
 * vendors/drdata/Setup                                                      *
 *                                                                           *
 *****************************************************************************/

// Хост по подразбиране за изпращач
 # defIfNot('SENDER_HOST', "localhost");


// Стандартен и-мейл на изпращача
 # defIfNot('SENDER_EMAIL', '??????');


/*****************************************************************************
 *                                                                           *
 * Клас 'editwatch_Setup' -                                                  *
 *                                                                           *
 * vendors/editwatch/Setup                                                   *
 *                                                                           *
 *****************************************************************************/

// Колко секунди да пази записите в таблицата минимално
 # defIfNot('EDITWATCH_REC_LIFETIME', 5*60);


/*****************************************************************************
 *                                                                           *
 * Изпращане на факс чрез efax                                               *
 *                                                                           *
 * vendors/efax/Setup                                                        *
 *                                                                           *
 *****************************************************************************/

// Максималният допустим брой на прикачените файлове и документи при изпращане на факсове
 # defIfNot('MAX_ALLOWED_ATTACHMENTS_IN_FAX', 10);


/*****************************************************************************
 *                                                                           *
 * Клас 'core_Expert'                                                        *
 *                                                                           *
 * vendors/expert/Expert                                                     *
 *                                                                           *
 *****************************************************************************/

// Къде да се съхранява състоянието на експертизата?
 # defIfNot('EXPERT_SAVE_STATE_IN_CACHE', TRUE);


// Дефинира колко минути е 'живо' състоянието
 # defIfNot('EXPERT_STATE_LIFETIME', 45);


// Тип на записа в кеша
 # defIfNot('EXPERT_CACHE_TYPE', 'Expert');


/*****************************************************************************
 *                                                                           *
 * Клас 'fancybox_Fancybox'                                                  *
 *                                                                           *
 * vendors/fancybox/Fancybox                                                 *
 *                                                                           *
 *****************************************************************************/

// Път до външния пакет
 # defIfNot('FANCYBOX_PATH', 'fancybox/1.3.4');


/*****************************************************************************
 *                                                                           *
 * Показва стартираните процеси                                              *
 *                                                                           *
 * vendors/fconv/Processes                                                   *
 *                                                                           *
 *****************************************************************************/

// @todo Чака за документация...
 # defIfNot('FCONV_HANDLER_LEN', 8);


/*****************************************************************************
 *                                                                           *
 * Конвертиране на файлове                                                   *
 *                                                                           *
 * vendors/fconv/Setup                                                       *
 *                                                                           *
 *****************************************************************************/

// Пътя до директорията с временните файлове
 # defIfNot('FCONV_TEMP_PATH', EF_TEMP_PATH."/fconv/");


/*****************************************************************************
 *                                                                           *
 * Клас 'fileman_Data' - Указател към данните за всеки файл                  *
 *                                                                           *
 * vendors/fileman/Data                                                      *
 *                                                                           *
 *****************************************************************************/

// Пътя до директорията за файловете е общ за всички инсталирани приложения
 # defIfNot('FILEMAN_UPLOADS_PATH', substr(EF_UPLOADS_PATH,0,strrpos(EF_UPLOADS_PATH,'/'));


/*****************************************************************************
 *                                                                           *
 * Клас 'fileman_Download' -                                                 *
 *                                                                           *
 * vendors/fileman/Download                                                  *
 *                                                                           *
 *****************************************************************************/

// @todo Чака за документация...
 # defIfNot('EF_DOWNLOAD_ROOT', '_dl_');


// @todo Чака за документация...
 # defIfNot('EF_DOWNLOAD_DIR', EF_INDEX_PATH.'/'.EF_SBF.'/'.EF_APP_NAME.'/'.EF_DOWNLOAD_ROOT);


// @todo Чака за документация...
 # defIfNot('EF_DOWNLOAD_PREFIX_PTR', '$*****');


/*****************************************************************************
 *                                                                           *
 * Клас 'fileman_Files' -                                                    *
 *                                                                           *
 * vendors/fileman/Files                                                     *
 *                                                                           *
 *****************************************************************************/

// Какъв е шаблона за манипулатора на файла?
 # defIfNot('FILEMAN_HANDLER_PTR', '$*****');


// Каква да е дължината на манипулатора на файла?
 # defIfNot('FILEMAN_HANDLER_LEN', strlen(FILEMAN_HANDLER_PTR));


/*****************************************************************************
 *                                                                           *
 * Клас 'fileman_Files2' -                                                   *
 *                                                                           *
 * vendors/fileman/Files2                                                    *
 *                                                                           *
 *****************************************************************************/

// Директория, в която ще се държат екстрактнатите файлове
 # defIfNot('FILEMAN_TEMP_PATH', EF_TEMP_PATH.'/fileman');


/*****************************************************************************
 *                                                                           *
 * Клас 'fileman_Setup' - Начално установяване на пакета 'fileman'           *
 *                                                                           *
 * vendors/fileman/Setup                                                     *
 *                                                                           *
 *****************************************************************************/

// Минималната големина на файла в байтове, за който ще се показва размера на файла след името му
// в narrow режим. По подразбиране е 100KB
 # defIfNot('LINK_NARROW_MIN_FILELEN_SHOW', 102400);


// Широчината на preview' то
 # defIfNot('FILEMAN_PREVIEW_WIDTH', 848);


// Височината на preview' то
 # defIfNot('FILEMAN_PREVIEW_HEIGHT', 1000);


// Широчината на preview' то в мобилен режим
 # defIfNot('FILEMAN_PREVIEW_WIDTH_NARROW', 547);


// Височината на preview' то в мобилен режим
 # defIfNot('FILEMAN_PREVIEW_HEIGHT_NARROW', 700);


// Максималната разрешена памет за използване
 # defIfNot('FILEMAN_DRIVER_MAX_ALLOWED_MEMORY_CONTENT', '200M');


// Път до gnu командата 'file'
 # defIfNot('FILEMAN_FILE_COMMAND', core_Os::isWindows();


// Минималната дължина на файла, до която ще се търси баркод
// 15kB
 # defIfNot('FILEINFO_MIN_FILE_LEN_BARCODE', 15360);


// Максималната дължина на файла, до която ще се търси баркод
// 1 mB
 # defIfNot('FILEINFO_MAX_FILE_LEN_BARCODE', 1048576);


// Максималната дължина на архивите, за които ще се визуализира информация
// 100 mB
 # defIfNot('FILEINFO_MAX_ARCHIVE_LEN', 104857600);


// Пътя до gs файла
 # defIfNot('FILEMAN_GHOSTSCRIPT_PATH', '');


// След колко минити да се изтрие от индекса, записа (грешката) за съответния тип на файла
 # defIfNot('FILEMAN_WEBDRV_ERROR_CLEAN', 5);


/*****************************************************************************
 *                                                                           *
 * Клас 'flexpaper_Render'                                                   *
 *                                                                           *
 * vendors/flexpaper/Render                                                  *
 *                                                                           *
 *****************************************************************************/

// Път до външния файл
 # defIfNot('FLEXPAPER_PATH', sbf("flexpaper/1.4.5/FlexPaperViewer.swf"));


/*****************************************************************************
 *                                                                           *
 * Генерира необходимият код за плейване на flv файлове                      *
 *                                                                           *
 * vendors/flvplayer/Embedder                                                *
 *                                                                           *
 *****************************************************************************/

// @todo Чака за документация...
 # defIfNot('FLVPLAYER_PATH', sbf("flvplayer/1.6.0/player_flv_maxi.swf"));


/*****************************************************************************
 *                                                                           *
 * Клас 'hclean_Purifier' - Пречистване на HTML                              *
 *                                                                           *
 * vendors/hclean/Purifier                                                   *
 *                                                                           *
 *****************************************************************************/

// Папка за съхранение на временните файлове
 # defIfNot('PURIFIER_TEMP_PATH', EF_TEMP_PATH.'/purifer');


/*****************************************************************************
 *                                                                           *
 * Клас 'hclean_Setup'                                                       *
 * Инсталира плъгина за изчистване на HTML полетата и създава директория,    *
 *                                                                           *
 * vendors/hclean/Setup                                                      *
 *                                                                           *
 *****************************************************************************/

// Дали да се вкара CSS'а в inline атрибут
 # defIfNot('HCLEAN_JSSANITIZER_PLACE_CSS_TO_INLINE', 'yes');


/*****************************************************************************
 *                                                                           *
 * Оцветяването на кода                                                      *
 *                                                                           *
 * vendors/hljs/Adapter                                                      *
 *                                                                           *
 *****************************************************************************/

// Версията на продукта
 # defIfNot('HLJS_VERSION', '7.3');


/*****************************************************************************
 *                                                                           *
 * Клас 'jqdatepick_Setup' -                                                 *
 *                                                                           *
 * vendors/jqdatepick/Setup                                                  *
 *                                                                           *
 *****************************************************************************/

// @todo Чака за документация...
 # defIfNot('JQDATEPICKER_VERSION', 'v4.0.6');


/*****************************************************************************
 *                                                                           *
 * Клас 'jquery_Jquery' -                                                    *
 *                                                                           *
 * vendors/jquery/Jquery                                                     *
 *                                                                           *
 *****************************************************************************/

// Версията на JQuery, която се използва
 # defIfNot('JQUERY_VERSION', '1.7.1');


/*****************************************************************************
 *                                                                           *
 * Клас 'jsgauge_Gauge'                                                      *
 *                                                                           *
 * vendors/jsgauge/Gauge                                                     *
 *                                                                           *
 *****************************************************************************/

// Път до външния файл
 # defIfNot('GAUGE_PATH', 'jsgauge/0.4.1');


/*****************************************************************************
 *                                                                           *
 * Клас 'keyboard_Setup' -                                                   *
 *                                                                           *
 * vendors/keyboard/Setup                                                    *
 *                                                                           *
 *****************************************************************************/

// @todo Чака за документация...
 # defIfNot('VKI_VERSION', '1.28');


/*****************************************************************************
 *                                                                           *
 * @category  vendors                                                        *
 *                                                                           *
 * vendors/legalact/Setup                                                    *
 *                                                                           *
 *****************************************************************************/

// Класа, който ще се използва за конвертиране
 # defIfNot('LEGALACT_DOCS_ROOT', 'c:/test/docs/');


/*****************************************************************************
 *                                                                           *
 * Конвертира markdown текстовете в HTML                                     *
 *                                                                           *
 * vendors/markdown/Render                                                   *
 *                                                                           *
 *****************************************************************************/

// defIfNot('MARKDOWN_VERSION', '1.0.1');
 # defIfNot('MARKDOWN_VERSION', 'extra-1.2.5');


/*****************************************************************************
 *                                                                           *
 * Създава плейър за изпълнение на видео и аудио                             *
 *                                                                           *
 * vendors/mejs/Adapter                                                      *
 *                                                                           *
 *****************************************************************************/

// Версията на продукта
 # defIfNot('MEJS_VERSION', '2.11.0.0');


/*****************************************************************************
 *                                                                           *
 * class mobio_Setup                                                         *
 *                                                                           *
 * vendors/mobio/Setup                                                       *
 *                                                                           *
 *****************************************************************************/

// Урл за изпращане на SMS-и през Мобио
 # defIfNot('MOBIO_URL', '');


/*****************************************************************************
 *                                                                           *
 * Установяване на пакета oembed                                             *
 *                                                                           *
 * vendors/oembed/Setup                                                      *
 *                                                                           *
 *****************************************************************************/

// Максимална широчина на ембеднатите неща
 # defIfNot('OEMBED_MAX_WIDTH', 600);


/*****************************************************************************
 *                                                                           *
 * Клас 'permanent_Setup' - Съхранява параметри и показания на обекти        *
 *                                                                           *
 * vendors/permanent/Setup                                                   *
 *                                                                           *
 *****************************************************************************/

// Какъв е максималния размер на некомпресираните данни в байтове
 # defIfNot('DATA_MAX_UNCOMPRESS', 10000);


/*****************************************************************************
 *                                                                           *
 * Клас от EF, който агрегира PHP Mailer Lite                                *
 *                                                                           *
 * vendors/phpmailer/Instance                                                *
 *                                                                           *
 *****************************************************************************/

// Подразбиращата се кодировка на съобщенията
 # defIfNot('PML_CHARSET', 'utf-8');


// Ник-а на изпращача по подразбиране
 # defIfNot('PML_DEF_NICK', 'support');


// Адреса във 'From' хедър-а на съобщението
 # defIfNot('PML_FROM_EMAIL', PML_DEF_NICK.'@'.$_SERVER['SERVER_NAME']);


// Името във 'From' хедър-а на съобщението
 # defIfNot('PML_FROM_NAME', $conf->EF_APP_TITLE.' '.mb_convert_case(PML_DEF_NICK,MB_CASE_TITLE,PML_CHARSET));


// Адреса на изпращача (Return-Path) на съобщението
 # defIfNot('PML_SENDER', PML_FROM_EMAIL);


// Какъв да е метода за изпращане на писма?
// ("mail", "sendmail", or "smtp")
 # defIfNot('PML_MAILER', 'sendmail');


// Къде се намира Sendmail?
 # defIfNot('SENDMAIL_PATH', '/usr/sbin/sendmail');


// Дефинираме пътя до кода на PHP_Mailer
 # defIfNot('PML_CLASS', '5.2/class.phpmailer.php');


// Да изпраща ли по единично писмата от адресите в 'To:'
 # defIfNot('PML_SINGLE_TO', FALSE);


/*****************************************************************************
 *                                                                           *
 * Клас  'physics_HumidityType' - Тип за температура                         *
 *                                                                           *
 * vendors/physics/HumidityType                                              *
 *                                                                           *
 *****************************************************************************/

// Колко цифри след запетаята да се показват
 # defIfNot('EF_HUMIDITYTYPE_DECIMALS', 0);


/*****************************************************************************
 *                                                                           *
 * Клас  'physics_PressureType' - Тип за температура                         *
 *                                                                           *
 * vendors/physics/PressureType                                              *
 *                                                                           *
 *****************************************************************************/

// Колко цифри след запетаята да се показват
 # defIfNot('EF_PRESSURETYPE_DECIMALS', 1);


// Мерната единица по подразбиране
 # defIfNot('EF_DEFAULT_UNIT_PRESSURE', 'bar');


/*****************************************************************************
 *                                                                           *
 * Клас  'physics_TemperatureType' - Тип за температура                      *
 *                                                                           *
 * vendors/physics/TemperatureType                                           *
 *                                                                           *
 *****************************************************************************/

// Колко цифри след запетаята да се показват
 # defIfNot('EF_TEMPERATURETYPE_DECIMALS', 2);


// Мерната единица по подразбиране
 # defIfNot('EF_DEFAULT_UNIT', '°C');


/*****************************************************************************
 *                                                                           *
 * class prosms_Setup                                                        *
 *                                                                           *
 * vendors/prosms/Setup                                                      *
 *                                                                           *
 *****************************************************************************/

// @todo Чака за документация...
 # defIfNot('PROSMS_URL', '');


// @todo Чака за документация...
 # defIfNot('PROSMS_USER', '');


// @todo Чака за документация...
 # defIfNot('PROSMS_PASS', '');


/*****************************************************************************
 *                                                                           *
 * class recently_Setup                                                      *
 *                                                                           *
 * vendors/recently/Setup                                                    *
 *                                                                           *
 *****************************************************************************/

// Максимален брой за предложенията за последно използвани стойности на поле
 # defIfNot('RECENTLY_MAX_SUGGESTION', 20);


// Максимален брой дни за запазване на стойност след нейната последна употреба
 # defIfNot('RECENTLY_MAX_KEEPING_DAYS', 60);


/*****************************************************************************
 *                                                                           *
 * class toast_Setup                                                         *
 *                                                                           *
 * vendors/statuses/Setup                                                    *
 *                                                                           *
 *****************************************************************************/

// Версията на toast message
 # defIfNot('STATUSES_TOAST_MESSAGE_VERSION', '0.3.0f');


/*****************************************************************************
 *                                                                           *
 * Клас 'thumbnail_Thumbnail' -                                              *
 *                                                                           *
 * vendors/thumbnail/Thumbnail                                               *
 *                                                                           *
 *****************************************************************************/

// @todo Чака за документация...
 # defIfNot('THUMBNAIL_FOLDER', EF_INDEX_PATH.'/'.EF_SBF.'/'.EF_APP_NAME.'/'.'_tb_');


// @todo Чака за документация...
 # defIfNot('THUMBNAIL_URL', '_tb_');


/*****************************************************************************
 *                                                                           *
 * Генериране на PDF файлове от HTML файл чрез web kit                       *
 *                                                                           *
 * vendors/webkittopdf/Converter                                             *
 *                                                                           *
 *****************************************************************************/

// Дефинира име на папка в която ще се съхраняват временните данни данните
 # defIfNot('WEBKIT_TO_PDF_TEMP_DIR', EF_TEMP_PATH."/webkittopdf");


/*****************************************************************************
 *                                                                           *
 * Инсталиране/Деинсталиране намениджъри за конвертиране в pdf               *
 *                                                                           *
 * vendors/webkittopdf/Setup                                                 *
 *                                                                           *
 *****************************************************************************/

// Изпълнимия файл на програмата
 # defIfNot('WEBKIT_TO_PDF_BIN', "/usr/bin/wkhtmltopdf");


// Оказва дали да се изпълни помощната програма (xvfb-run)
 # defIfNot('WEBKIT_TO_PDF_XVFB_RUN', TRUE);


// xvfb-run - Ширина на екрана
 # defIfNot('WEBKIT_TO_PDF_SCREEN_WIDTH', "640");


// xvfb-run - Височина на екрана
 # defIfNot('WEBKIT_TO_PDF_SCREEN_HEIGHT', "480");


// xvfb-run - Дълбочина на цвета
 # defIfNot('WEBKIT_TO_PDF_SCREEN_BIT', "16");


/*****************************************************************************
 *                                                                           *
 * class currency_Setup                                                      *
 *                                                                           *
 * vendors/wund/Setup                                                        *
 *                                                                           *
 *****************************************************************************/

// Задаване на основна валута
 # defIfNot('WUND_DEFAULT_LOCATION', 'Bulgaria/Sofia');


/*****************************************************************************
 *                                                                           *
 * XMPP съобщения                                                            *
 *                                                                           *
 * vendors/xmpphp/Sender                                                     *
 *                                                                           *
 *****************************************************************************/

// @todo Чака за документация...
 # defIfNot('XMPPHP_VERSION', '0.1rc2-r77');


/*****************************************************************************
 *                                                                           *
 * class xmpphp_Setup                                                        *
 *                                                                           *
 * vendors/xmpphp/Setup                                                      *
 *                                                                           *
 *****************************************************************************/

// @todo Чака за документация...
 # defIfNot('XMPPHP_SERVER', 'talk.google.com');


// @todo Чака за документация...
 # defIfNot('XMPPHP_PORT', '5222');


// @todo Чака за документация...
 # defIfNot('XMPPHP_USER', '');


// @todo Чака за документация...
 # defIfNot('XMPPHP_PASSWORD', '');


// @todo Чака за документация...
 # defIfNot('XMPPHP_DOMAIN', 'gmail.com');


