<?php


/**
 * Клас 'hr_tpl_Contract' -
 *
 * @todo: Да се документира този клас
 *
 * @category   Experta Framework
 * @package    hr
 * @author
 * @copyright  2006-2011 Experta OOD
 * @license    GPL 2
 * @version    CVS: $Id:$\n * @link
 * @since      v 0.1
 */
class hr_tpl_Contract extends core_BaseClass
{
    /**
     *  Инициализиране на обекта
     */
    function init($params = array())
    {
        
        $rec = (object) $params;
        
        $this->html = "
<h1>Т Р У Д О В   Д О Г О В О Р</h1>

<p>№ {$rec->id}/{$rec->date} г. 

<p>Днес, {$rec->date} г. в гр./с {$rec->place}, между:

<p><b>{$rec->companyName}</b>

<p>със седалище и адрес на управление     {$rec->CompanyAddress},

<p>регистрирано по фирмено дело № ……../…………г. на ………………, номер от НДР …………………, ЕИК по БУЛСТАТ …………………….., представлявано от     

<b>{$rec->companyManager}</b> – с ЕГН <b>{$rec->companyManagerEgn}</b>

<p>от една страна, наричан/а/ за краткост в договора <b>РАБОТОДАТЕЛ</b> и 
    
<p><b>{$rec->employeeNames}</b>

<p>от друга страна, наричан/а/ <b>РАБОТНИК /СЛУЖИТЕЛ/</b>

<p> с ЕГН: {$rec->employeeEgn}, 
местоживеене: {$rec->employeeAddress}, 
лична карта №:{$rec->employeeIdCard}, изд. на {$rec->employeeIdCardDate} г., от МВР {$rec->employeeIdCardIssuer}., 
oбразование: ………………………………., 
специалност: ………………………………………, 
диплома №: ………………., издадена от ……………………………………………………, 
трудов стаж: ………………,

на основание: {rec->contractReason}, 

се сключи настоящият <b>трудов договор</b>:

<p>I. <b>РАБОТОДАТЕЛЯТ</b> възлага, а <b>РАБОТНИКЪТ/СЛУЖИТЕЛЯТ/</b> приема: 

<p>1. Да изпълнява в <b>{$rec->companyName}</b>, длъжността <b>{$rec->posittions}, 
НКИД {rec->nkid}, 
НКПД {rec->nkpd}, 
в отдел (място на работа) {$rec->department} със задължения, утвърдени от Работодателя в длъжностна характеристика, представляващa неразделна част към настоящия трудов договор;

<p>2. При условията на …. /………………./ часа работно време с основно месечно трудово възнаграждение в размер на {$rec->baseSalary} с периодичност на изплащане ……………………………….. и с допълнително възнаграждение ….% за всяка година трудов стаж. 

<p>II. Работодателят е длъжен:

<p>1. Да заплаща трудовото възнаграждение на Работника /Служителя/  ежемесечно;

<p>2. Да осигурява здравно и социално Работника /Служителя/ за всички осигурителни рискове съгласно условия и по ред, установени в КСО и ЗЗО;

<p>3. Да запознае Работника /Служителя/ с установената технология на работа във фирмата;

<p>4. Да създаде безопасни условия за работа на Работника /Служителя/.

<p>III. Работникът /Служителят/ е длъжен:

<p>1. Да изпълнява трудовите си задължения в съответствие с установената трудова и технологична дисциплина;

<p>2. Да изпълнява стриктно всички задължения, които произтичат от длъжностната му характеристика;

<p>3. Да опазва поверените му технически средства;

<p>4. Да пази доброто име на фирмата, както и да не разпространява информация, считана от Работодателя за поверителна.

<p><b>IV. Работникът /Служителят/  има право на {$rec->holidays} работни дни платен годишен отпуск съгласно чл. 155 от КТ.</b>

<p><b>V. Срокът на настоящия трудов договор е {$rec->contractTerm}</b>

<p>VI. Срокът на предизвестие за прекратяване на трудовия договор е 30 дни.

<p>VII. За неуредени в настоящия трудов договор условия се прилагат разпоредбите на Кодекса на труда и нормативните актове на българското законодателство.

<p>VIII. Работникът /Служителят/  се задължава да постъпи на работа на ………………….г.

<p>Настоящият договор се състави в два еднообразни екземпляра, по един за всяка от страните.

<table>
<tr>
    <td>РАБОТОДАТЕЛ:</td>
    <td height=50 valign=bottom>/ подпис и печат /</td>
</tr>
<tr>
    <td>РАБОТНИК/СЛУЖИТЕЛ/:</td>
    <td height=50 valign=bottom>/ подпис /</td>
</tr>
</table>";
    }
}